<dcont undergrupp=d titel="Komplementära boken">
 
<font size = 4>

<A HREF="Komplement.Bok.html"><IMG SRC="fm2html-toc.gif" width=16 height=16 alt="">Innehåll</A>
<!-- This file was created with the fm2html filter.The filter is copyright Norwegian Telecom Research and was programmed by Jon Stephenson von Tetzchner.  -->
<H2><A NAME="HDR0">F&ouml;rord</A></H2>
Vars&aring;god! En ny upplaga av boken som beskriver vad du har l&auml;st och vad du kan t&auml;nkas att l&auml;sa i framtiden. Boken beskriver hur vi teknologer uppfattar kurserna p&aring; v&aring;r utbildning och har som m&aring;l att visa att man har mycket kul att l&auml;sa framf&ouml;r sig n&auml;r man b&ouml;rjar p&aring; D-utbildningen samtidigt som att m&aring;nga kurser &auml;r arbetsamma. Det &auml;r ocks&aring; meningen att man skall kunna ta hj&auml;lp av boken d&aring; man v&auml;ljer kurser till h&ouml;gre &aring;rskurs.<p>
Den nya upplagan inneh&aring;ller dels nyskrivet material samt uppdatering av gamla beskrivningar.<p>
Slutligen vill jag tacka alla som har hj&auml;lpt till med att f&aring; fram denna bok och d&auml;ribland Utbildningsn&auml;mnd D som finansierat det hela.<p>
Magnus Runesson<BR>
Studien&auml;mndsordf&ouml;rande<BR>
D-sektionen, LiTH 94/95<p>
<H2><A NAME="HDR1">Om bokens uppl&auml;ggning</A></H2>
I v&aring;rt f&ouml;rs&ouml;k att f&aring; n&aring;gon som helst l&auml;ttfattlig ordning p&aring; inneh&aring;llet har vi sorterat kurserna efter vilken institution de ges p&aring;. Inom varje kapitel/institution &auml;r kurserna sorterade s&aring; att obligatoriska kurser kommer f&ouml;rst, i n&aring;gorlunda den ordning man l&auml;ser dem, sedan profilkurser och sist valfria kurser. Notera dock att alla profilkurser r&auml;knas som valfria f&ouml;r de som l&auml;ser andra profiler. Sist i boken finns n&aring;gra av de kurser fr&aring;n Fakulteten f&ouml;r Humaniora och Samh&auml;llsvetenskap (FilFak) som ges p&aring; D-utbildningen.<p>
Boken g&ouml;r inga anspr&aring;k p&aring; att vara komplett; flera kurser p&aring; D-utbildningen saknas och inga kurser fr&aring;n &aring;rskurs fem finns med. Gl&ouml;m inte att denna bok bara &auml;r ett komplement till studiehandboken!<p>
Boken &auml;r tryckt p&aring; objektorienterat, flimmerfritt och l&aring;gstr&aring;lande h&ouml;guppl&ouml;sningspapper hos IT- &amp; multimediaf&ouml;retaget Linus &amp; Linn&eacute;a AB. Boken uppfyller MPRII och &auml;r n&auml;stan ISO9000-certifierad.<p>
<I>J&ouml;rgen Ahlberg<BR>
</I>Redakt&ouml;r<p>
<A NAME="ENDFILE"><PRE> </PRE></A><A HREF="Komplement.Bok.html"><IMG SRC="fm2html-toc.gif" width=16 height=16 alt="">Innehåll</A> <A HREF="Kurser.html"><IMG SRC="fm2html-next.gif" width=16 height=16 alt="">Nästa kapitel</A> 
</p>

<font size=4>
</dcont>

