<HTML><HEAD><TITLE>Datateknologsektionen LiTH - Komplementära boken</TITLE></HEAD><BODY TEXT=#000000 BGCOLOR=#FFFFFF LINK=#0000EE VLINK=#551A8B ALINK=#FF0000><img src=/d/icons/lheader_d.gif width=169 border=0 vspace=0 align=left hspace=0 height=20 ALT=><img src=/d/icons/rheader_d.gif width=100% border=0 vspace=0 height=20 ALT=><p>

<font size = 4>

<A HREF="Komplement.Bok.html"><IMG SRC="fm2html-toc.gif" width=16 height=16 alt="">Innehĺll</A> <A HREF="Framsida.html"><IMG SRC="fm2html-previous.gif" width=16 height=16 alt="">Föregĺende kapitel</A>
<!-- This file was created with the fm2html filter.The filter is copyright Norwegian Telecom Research and was programmed by Jon Stephenson von Tetzchner.  -->
<H2><A NAME="HDR0">Ekonomiska Institutionen</A></H2>
<H3><A NAME="HDR1">Engelska</A></H3>
Kurskod: <p>

<DL>
<DD>TEIE24<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (valfri)<BR>
</DL>


Engelska &auml;r en humaniorakurs p&aring; tre po&auml;ng. Efter att ha skrivit det obligatoriska diagnostiska provet ser du hur du ligger till i spr&aring;ket. F&aring;r du bra resultat p&aring; det obligatoriska provet kan du f&aring; chansen att f&aring; kursen godk&auml;nd genom en muntlig tentamen, &auml;r inte resultatet tillfredsst&auml;llande p&aring; det diagnostiska provet kan du g&aring; p&aring; en f&ouml;rberedelsekurs f&ouml;r att tr&auml;na upp dina kunskaper. F&ouml;rberedelsekursen ger inga studiemedelspo&auml;ng men &auml;r en bra hj&auml;lp f&ouml;r att tr&auml;na upp engelskan. H&auml;r undervisas i de viktigaste delarna i grammatiken och man f&aring;r l&auml;ra sig att l&auml;sa och sammanfatta en l&auml;ngre text. Efter f&ouml;rberedelsekursen, som varar i tv&aring; perioder, b&ouml;rjar den riktiga kursen som ocks&aring; p&aring;g&aring;r i tv&aring; perioder. Den &auml;r uppdelad i en muntligdel och en textdel, och man brukar ha olika assistenter i de tv&aring; delarna.<p>
F&ouml;r att f&aring; godk&auml;nt i den muntliga delen r&auml;cker det att n&auml;rvara p&aring; lektionerna, samt h&aring;lla minst ett f&ouml;redrag under kursens g&aring;ng. F&ouml;redraget kan handla om vad som helst, det enda kravet &auml;r att det ska vara p&aring; hyfsat bra engelska.Textdelen kr&auml;ver d&auml;remot ingen n&auml;rvaro. Du f&aring;r den godk&auml;nd bara du klarar tentan. Inneh&aring;llet i tentan &auml;r baserat p&aring; det som tas upp p&aring; lektionerna.<p>
Engelska &auml;r en rolig kurs och den passar bra som omv&auml;xling bland alla matematiska kurser. Med tanke p&aring; att m&aring;nga kursb&ouml;cker &auml;r p&aring; engelska &auml;r det bra att fr&auml;scha upp gymnasiekunskapema och samtidigt l&auml;ra sig en mer teknikinriktad engelska. Du l&auml;r dig m&aring;nga anv&auml;ndbara ord inom det tekniska omr&aring;det.<p>
<H3><A NAME="REF10168">Industriell ekonomi, grundkurs</A></H3>
Kurskod: <p>

<DL>
<DD>TEIE57<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (obligatorisk)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Industriell ekonomi, forts&auml;ttningskurs<BR>
</UL>


M&aring;let med kursen &auml;r att man f&aring;r:<p>

<UL>
<LI>orientering om f&ouml;retagets allm&auml;nna villkor och verksamhet.<BR>

<LI>insikt i f&ouml;retagets planering, redovisning och rapportering.<BR>

<LI>f&auml;rdighet i ekonomisk probleml&ouml;sning och kalkylering.<BR>

<LI>kunskap om f&ouml;retagets finansiering.<BR>

<LI>&ouml;ka sitt kunnande om olika ekonomiska begrepp.<BR>
</UL>


Under lektionerna l&auml;r man sig att ber&auml;kna st&ouml;rsta vinsten av en investering genom att ber&auml;kna annuitet och nuv&auml;rde f&ouml;r investeringen med h&auml;nsyn till skatt och inflation. Man f&aring;r l&auml;ra sig hur man g&ouml;r dubbel bokf&ouml;ring n&auml;r man har en m&auml;ngd olika konton. Hur mycket ska en f&auml;rdig produkt kosta f&ouml;r att man skall f&aring; en vinst p&aring; x antal kronor? Detta g&ouml;rs genom att ber&auml;kna olika p&aring;l&auml;gg f&ouml;r t ex materialomkostnader och tillverkningskostnader. Sista delen av kursen &auml;gnas bl a &aring;t den finansiella marknaden d&auml;r man tar upp riskerna och avkastningen av bland annat aktier och optioner.<p>
Under mitten av kursen f&aring;r man en frivillig hemuppgift, som ger po&auml;ng p&aring; tentan, med fr&aring;gor som kan l&ouml;sas med hj&auml;lp av en &aring;rsredovisning. F&ouml;rel&auml;sare och examinator &auml;r Kaj Rosling som &auml;r mycket bra. Kaj anv&auml;nder mycket overhead men det g&ouml;r ingenting f&ouml;r man f&aring;r ut kopior innan f&ouml;rel&auml;sningen. Litteraturen best&aring;r av &quot;Den nya aff&auml;rsredovisningen&quot;, &quot;Kalkyler som beslutsunderlag&quot; samt ett kompendium. B&ouml;ckerna &auml;r l&auml;ttl&auml;sta medan kompendiet &auml;r r&ouml;rigt. Man klarar tentan bra &auml;ven om man inte k&ouml;per &quot;Kalkyler som beslutsunderlag&quot;.<p>
Sammanfattningsvis kan man s&auml;ga att det &auml;r en intressant och rolig kurs som man har nytta av. Tentan ska inte vara n&aring;gra problem att klara om man g&aring;r p&aring; lektionerna.<p>
<H3><A NAME="HDR2">Teknisk tyska</A></H3>
Kurskod: <p>

<DL>
<DD>TEIE29<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (valfri)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI>Tyska som B-spr&aring;k eller motsvarande<BR>
</UL>


Kursen ges f&ouml;r D3 under perioderna tv&aring; till fyra med 30 timmars undervisning i form av storseminarier per period. Den f&ouml;rsta perioden &auml;gnas &aring;t repetition av den tyska grammatiken i rask takt, vilket kr&auml;ver ett aktivt deltagande.<p>
Kurslitteraturen best&aring;r av f&ouml;rutom grammatik och forml&auml;rabok av artikelkompendium och stenciler. Under f&ouml;rsta perioden behandlas vanliga tyska artiklar f&ouml;r att senare angripa sv&aring;rare tekniska texter. Ut&ouml;ver den vanliga text- och glosl&auml;sningen ges ett antal &ouml;vers&auml;ttnings- och sammanfattningsuppgifter samt att man h&aring;ller &auml;ven n&aring;gra korta f&ouml;redrag. Tentamen delas upp i en grammatikdel, en text- och ordf&ouml;rst&aring;elsedel och en muntlig del som tenteras vid skilda tillf&auml;llen.<p>
<H3><A NAME="HDR3">Teknisk franska</A></H3>
Kurskod: <p>

<DL>
<DD>TEIE28<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (valfri)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI>Franska som B-spr&aring;k eller motsvarande<BR>
</UL>


Det h&auml;r &auml;r kursen f&ouml;r dig som k&auml;nner att din gamla gymnasiefranska b&ouml;rjar bli mogen att dammas av och fr&auml;schas upp en aning. Den omfattar fyra po&auml;ng och str&auml;cker sig &ouml;ver tre l&auml;sperioder, vilket medf&ouml;r att den h&aring;ller ett ganska behagligt tempo med cirka en lektion i veckan och att den inte tar allt f&ouml;r mycket tid fr&aring;n parallellt p&aring;g&aring;ende kurser. Man skall dock vara beredd p&aring; att arbeta ett tag med hemuppgifterna som i allm&auml;nhet ges att g&ouml;ras mellan lektionstillf&auml;llena.<p>
Kursen h&aring;lls av Jean Aranda, en glad fransman som varvar grammatiken med m&aring;nga sm&aring; roliga anekdoter. Kurslitteratur finns det ingen, men ett vettigt lexikon och en grammatikbok kommer v&auml;l till pass. De texter och uppgifter man behandlar under kursensg&aring;ng delas ut av Jean mot en mindre kostnad svarande mot kopieringskostnader.<p>
Examinationen best&aring;r av tv&aring; delar, en skriftlig och en muntlig. Den skriftliga delen &auml;r en vanlig tenta, medan den muntliga best&aring;r i en diskutera och svara p&aring; fr&aring;gor om en roman som man har l&auml;st under kursens g&aring;ng.<p>
Som en trevlig avslutning p&aring; kursen och en bra inledning p&aring; sommarlovet anordnas det under lovets tv&aring; f&ouml;rsta veckor en spr&aring;kresa till La Rochelle p&aring; atlantkusten. Man bor d&aring; hos en fransk familj och har lektioner dagtid varvat med sm&aring; utflykter till traktens sev&auml;rdheter.<p>
<H3><A NAME="HDR4">Juridik I </A></H3>
Kurskod: <p>

<DL>
<DD>TEIE94<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2,5  (valfri)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF10168">Industriell ekonomi, grundkurs (sidan 1)</A><BR>
</UL>


Juridik I &auml;r en kurs som g&aring;r f&ouml;r I4 och I5 men som &auml;r valfri f&ouml;r D-are. Juridik &auml;r ett &auml;mne som alla m&auml;nniskor har nytta av att k&auml;nna till. Denna kurs &auml;r mycket allm&auml;nbildande och nyttig om man inte har n&aring;gon tidigare erfarenhet av juridik.<p>
Kursen &auml;r uppdelad i 15 f&ouml;rel&auml;sningar och 5 lektioner. F&ouml;rel&auml;sningarna &auml;r rogivande och tar upp &auml;mnen som avtalsr&auml;tt, k&ouml;pr&auml;tt, fastighetsr&auml;tt, associationsr&auml;tt, arbetsr&auml;tt, straffr&auml;tt, lite EG-r&auml;tt med mera, &auml;mnen som &auml;r bra att k&auml;nna till s&aring;v&auml;l som privatperson som i arbetslivet. Lektionerna &auml;r avsedda f&ouml;r gemensam l&ouml;sning av tentauppgifter vilket &auml;r mycket bra tr&auml;ning inf&ouml;r tentan.<p>
Tentamen brukar av de flesta anses vara ganska stressig men brukar inte v&aring;lla n&aring;gra st&ouml;rre bekymmer om man har g&aring;tt p&aring; f&ouml;rel&auml;sningarna eller framf&ouml;rallt lektionerna. Kurslitteraturen &auml;r bra men inte speciellt n&ouml;dv&auml;ndig, lagtextkompendiet r&auml;cker l&aring;ngt. Juridik I &auml;r lite mer omfattande &auml;n Datajuridisk &ouml;versiktskurs, den t&auml;cker fler omr&aring;den och g&aring;r in lite mer p&aring; djupet. Datajuridiska kursen tar dock upp Datalagen och Avtal-90 som inte ber&ouml;rs i denna kurs. <p>
<H2><A NAME="HDR5">Institutionen f&ouml;r Datavetenskap</A></H2>
<H3><A NAME="REF55185">Programmering i inkrementellt system (PINK) </A></H3>
Kurskod: <p>

<DL>
<DD>TDDB93<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>6  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI>Orientering datateknik och datorutrustning<BR>

<LI><A HREF="Kurser.html#REF46914">Diskret matematik och logik (sidan 39)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF79438">Artificiell intelligens (AI) (sidan 7)</A><BR>

<LI><A HREF="Kurser.html#REF30138">Data- och programstrukturer (DPS) (sidan 17)</A><BR>

<LI><A HREF="Kurser.html#REF62543">Logikprogrammering (sidan 16)</A><BR>
</UL>


PINKen &auml;r den f&ouml;rsta st&ouml;rre programeringskursen p&aring; D-linjen. I PINK-kursen f&aring;r man l&auml;ra sig programmera i LISP, ett programspr&aring;k som anv&auml;nds inom bland annat artificiell intelligens. Vi f&aring;r ocks&aring; tillf&auml;lle att till&auml;mpa v&aring;ra kunskaper fr&aring;n bland annat kursen Diskret matematik och logik. Lisp &auml;r ett imperativt programspr&aring;k och skrivs i s&aring; kallad &quot;prefix notation&quot; det vill s&auml;ga man skriver ett uttryck med operator eller funktionerna f&ouml;rst ist&auml;llet f&ouml;r mitt i uttrycket vilket man &auml;r van vid (infix notation).<p>
Kursen kr&auml;ver inga f&ouml;rkunskaper i programmering, och man har ingen st&ouml;rre f&ouml;rdel av att ha programmerat i andra spr&aring;k tidigare. Kursens tre moment &auml;r teori med efterf&ouml;ljande tentamen, laborationer samt ett projekt. P&aring; laborationerna testar man praktiskt det man l&auml;rt sig p&aring; f&ouml;rel&auml;sningarna. Projektet &auml;r ett st&ouml;rre programeringsarbete som kommer i slutet av kursen och innefattar b&aring;de kodning och dokumentation. P&aring; laborationerna l&ouml;ser man konstruerade problem, medan man under projektet sj&auml;lv v&auml;ljer vad man vill g&ouml;ra, t ex tillverka ett eget othellospel eller adventure.<p>
<H3><A NAME="REF11029">Logik, grundkurs</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA15<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (obligatorisk, utg&aring;ende)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF64291">Grundl&auml;ggande diskret matematik (sidan 38)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF79438">Artificiell intelligens (AI) (sidan 7)</A><BR>

<LI><A HREF="Kurser.html#REF62543">Logikprogrammering (sidan 16)</A><BR>
</UL>


Logik, i den form som ing&aring;r i D-linjen, p&aring;minner ganska mycket om matematik. Man f&ouml;rs&ouml;ker s&auml;tta upp regler f&ouml;r hur, om och n&auml;r man kan dra vissa slutsatser. Man vill kunna bevisa att det &auml;r korrekt att dra de slutsatser man vill. Logikens tankes&auml;tt anv&auml;nds bl a i datorspr&aring;ket PROLOG och i expertsystem. Kursen inneh&aring;ller en genomg&aring;ng av logikens grundl&auml;ggande metoder och begrepp.<p>
Logiken anses vara en av de sv&aring;raste kurserna p&aring; D-linjen. Man har under flera &aring;r arbetat med att f&ouml;rs&ouml;ka h&ouml;ja examinationskvoten p&aring; kursen. Detta har bl a resulterat i fler lektioner och att man f&aring;r ta med sig kurslitteraturen p&aring; tentamen. En av anledningarna till att kursen upplevs s&aring; sv&aring;r &auml;r att den skiljer sig s&aring; mycket fr&aring;n alla andra kurser. Man m&aring;ste l&auml;ra sig ett helt nytt syns&auml;tt och en upps&auml;ttning nya begrepp. Ett tips &auml;r att anv&auml;nda lite tid att l&auml;ra sig alla begrepp ordentligt, det har man nytta av n&auml;r man ska l&auml;ra sig resten av kursen. L&auml;s g&auml;rna igenom kurslitteraturen i b&ouml;rjan, f&ouml;r en del f&ouml;rklaringar kommer inte f&ouml;rr&auml;n i slutet. Kursen upplevs nog, med all r&auml;tt, som v&auml;ldigt teoretisk. Men om man inte l&aring;ter sig avskr&auml;ckas av detta kommer man att finna att sj&auml;lva kursinneh&aring;llet faktiskt inte &auml;r o&ouml;verkomligt. Om man ska plocka ut n&aring;gra viktiga saker att t&auml;nka p&aring; n&auml;r man l&auml;ser kursen b&ouml;r man f&ouml;r det f&ouml;rsta l&auml;ra sig begrepp och beteckningar s&aring; snabbt som m&ouml;jligt. Dessutom &auml;r det att rekommendera att man hela tiden f&ouml;rs&ouml;ker h&auml;nga med p&aring; f&ouml;rel&auml;sningarna och framf&ouml;r allt p&aring; lektionerna.<p>
<H3><A NAME="REF82359">Datastrukturer och algoritmer (DALG)</A></H3>
Kurskod: <p>

<DL>
<DD>TDDB57<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF55185">Programmering i inkrementellt system (PINK) (sidan 4)</A><BR>

<LI><A HREF="Kurser.html#REF46914">Diskret matematik och logik (sidan 39)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Flertalet IDA-kurser.<BR>
</UL>


Kursmaterialet best&aring;r av en bok, ett kompendium inneh&aring;llande laborationer, &ouml;vningar, teoritill&auml;gg, facit och &ouml;vningstentor. Boken &auml;r p&aring; engelska och heter &quot;Data structures and algorithms&quot; (Aho, Hopcraft, Ullman). Den &auml;r mycket matnyttig och kan anv&auml;ndas som referens i efterf&ouml;ljande kurser i programmering. Den inneh&aring;ller all teori i kursen, d v s metoder f&ouml;r algoritmanalys, tids- och rumskomplexitet, abstrakta datatyper s&aring;som listor, stackar, k&ouml;er, tr&auml;d och olika former av m&auml;ngder samt implementeringar i Pascal, olika sorteringsrutiner, urvalsmetoder, metoder f&ouml;r algoritmdesign, h&auml;rska och s&ouml;ndra, dynamisk programmering och giriga algoritmer.<p>
Lektionerna anv&auml;nds dels till &ouml;vningsuppgifterna och klarg&ouml;randen om teorin, dels till genomg&aring;ngar av laborationerna.<p>
Laborationerna &auml;r sex stycken a fyra timmar och av varierande sv&aring;righetsgrad (de &auml;r sv&aring;ra p&aring; slutet) vilket inneb&auml;r en laboration i veckan (med ett par timmars f&ouml;rberedelser). De &auml;r nyttiga och troligen den stora beh&aring;llningen av kursen, eftersom man f&aring;r se hur teorin fungerar i &quot;verkligheten&quot;. I b&ouml;rjan av kursen ges en kort repetition och nyutl&auml;rning av Pascal.<p>
<H3><A NAME="REF17752">Objektorienterad systemutveckling (OOS)</A></H3>
Kurskod: <p>

<DL>
<DD>TDDB33<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF82359">Datastrukturer och algoritmer (DALG) (sidan 5)</A><BR>
</UL>


Kursen &auml;r (blir) en projektkurs som l&auml;r ut grunderna i objektorentering, en modern och kraftfull metod f&ouml;r programvarukonstruktion. Det objektorienterade spr&aring;k som anv&auml;nds &auml;r C++ som &auml;r sv&aring;rt att l&auml;ra sig men anv&auml;nds mycket ute p&aring; f&ouml;retag. Det finns m&aring;nga varianter p&aring; objektorienterade metoder, och den som anv&auml;nds i projektet &auml;r en bantad blandning av diverse andra metoder. Dessa andra g&aring;s igenom kursivt och kursen k&auml;nns lite ostrukturerad.<p>
Projektarbetet var 1994 mycket l&ouml;st specificerat och projektgruppen fick till stor del st&auml;lla krav p&aring; sig sj&auml;lva, vilket &auml;r sv&aring;rt och tar mycket tid. C++ &auml;r sv&aring;rt och lektionerna &auml;r f&aring;; det kr&auml;vs en del sj&auml;lvst&auml;ndigt arbete f&ouml;r att s&auml;tta sig in i spr&aring;ket. Man hinner verkligen inte l&auml;ra sig programmera bra i C++. Det b&auml;sta med kursen &auml;r att man st&ouml;ter p&aring; alla de problem som uppst&aring;r n&auml;r man arbetar i grupp. Man l&auml;r sig mycket om grupparbete och samordning som man bara kan l&auml;ra sig av erfarenhet.<p>
<H3><A NAME="REF71272">Processprogrammering</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA21<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF82359">Datastrukturer och algoritmer (DALG) (sidan 5)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF51182">Distribuerade system (sidan 14)</A><BR>

<LI><A HREF="Kurser.html#REF91839">Datorarkitektur (DARK) (sidan 15)</A><BR>

<LI><A HREF="Kurser.html#REF58374">Datas&auml;kerhetsmetoder (sidan 36)</A><BR>
</UL>


En l&auml;rorik och omfattande mjukvarukurs. Kurslitteraturen best&aring;r, av en rej&auml;l amerikansk tegelsten med dinosaurier p&aring; framsidan kallad &quot;Operating system concepts&quot;. Dessutom finns en kompletterande artikelsamling, f&ouml;rel&auml;sningsanteckningar och laborationsmaterial i kompendieform. F&ouml;rel&auml;sningarna &auml;r ganska OH-baserade.<p>
Kursen b&ouml;rjar med att ta upp parallellprogrammering och de problem som kan uppst&aring; d&aring; processer konkurrerar om resurser som CPU, minne och I/O-enheter. Senare tas operativsystemsfunktioner i allm&auml;nhet upp, ofta bra exemplifierat med existerande OS som UNIX. Bland annat diskuteras schemal&auml;ggning, minneshantering och virtuella minnen.<p>
Boken g&aring;r bra att anv&auml;nda till sj&auml;lvstudier &auml;ven om den d&aring; och d&aring; blir lite upprepande. Laborationskursen &auml;r bra och tidskr&auml;vande vilket s&aring;ledes betyder att den &auml;r nyttig. H&auml;r ing&aring;r den mer eller mindre ber&ouml;mda t&aring;gbanelaborationen, som r&auml;tt programmerad l&aring;ter leksakst&aring;g k&ouml;ra parallellt utan att krocka. Roligt! I en annan laboration f&aring;r du g&ouml;ra ett virtuellt minne. I ytterligare en annan laboration f&aring;r du programmera en dator att kommunicera med andra datorer.<p>
Sammanfattningsvis &auml;r kursen i processprogrammering en givande kurs som ger klart &ouml;kad f&ouml;rst&aring;else f&ouml;r operativsystem och dess funktioner. De flesta tycker dessutom att det &auml;r riktigt roligt.<p>
<H3><A NAME="REF79438">Artificiell intelligens (AI)</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA13<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF55185">Programmering i inkrementellt system (PINK) (sidan 4)</A><BR>

<LI><A HREF="Kurser.html#REF46914">Diskret matematik och logik (sidan 39)</A><BR>

<LI><A HREF="Kurser.html#REF82359">Datastrukturer och algoritmer (DALG) (sidan 5)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF59540">Expertsystem, metodik och verktyg (sidan 14)</A><BR>

<LI>AI-programmering<BR>
</UL>


AI l&aring;ter v&auml;ldigt sp&auml;nnande, men n&auml;r man l&auml;ser kursen inser man att AI bara handlar om vanliga, hederliga ingenj&ouml;rsm&auml;ssiga metoder. Kursen ger en &ouml;versikt &ouml;ver ett antal delar av AI-omr&aring;det: s&ouml;kmetoder, kunskapsrepresentation, behandling av naturligt spr&aring;k m m. I de flesta fall handlar det om att l&auml;ra sig f&ouml;rst&aring; hur vissa algoritmer och datastrukturer fungerar och &auml;r uppbyggda. Det finns en del saker som varken tas upp i boken eller p&aring; OH-bilderna. <p>
Eftersom kursen tar upp m&aring;nga delomr&aring;den som h&auml;nger ganska l&ouml;st ihop, s&aring; kan man h&auml;nga med p&aring; en f&ouml;rel&auml;sning &auml;ven om man missat f&ouml;reg&aring;ende. Labbarna &auml;r fem till antalet och g&ouml;rs i LISP. Den f&ouml;rsta labben &auml;r en ren LISP-repetition. Sen kommer flera tunga labbar som tar mycket mer tid &auml;n specificerat. I geng&auml;ld varvas de med t ex en mycket l&auml;tt lab om neuronn&auml;t.<p>
<H3><A NAME="REF15137">Programutvecklingsmetodik och programmeringsprojekt (PUM)</A></H3>
Kurskod: <p>

<DL>
<DD>TDDB60<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>6,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF15137">Programutvecklingsmetodik och programmeringsprojekt (PUM) (sidan 7)</A><BR>
</UL>


PUMen &auml;r en kurs man l&auml;tt f&aring;r f&ouml;rutfattade meningar om redan under nollperioden det &aring;r man b&ouml;rjar p&aring; D-linjen. Kursen beh&ouml;ver dock inte vara s&aring; farlig som det l&aring;ter sig h&ouml;ras. Kursen &auml;r visserligen t&auml;nkt att ta sina modiga 200 till 250 timmar, men f&ouml;r en del grupper drar det iv&auml;g till b&aring;de tre och fyrahundra timmar, beroende p&aring; gruppens ambitionsniv&aring; och storleken p&aring; projektet. Man l&auml;gger ned mycket tid men i geng&auml;ld f&aring;r man mycket tillbaka.<p>
Hela kursen bygger p&aring; programmeringsprojektet. Det viktiga &auml;r dock inte att f&aring; fram ett fungerande program utan att gruppen har jobbat bra med planeringen. Det verkar ibland som om dokumenten &auml;r det som ger flest po&auml;ng hos examinatorn. Det &auml;r lite konstigt eftersom han &auml;r fruktansv&auml;rt d&aring;lig p&aring; att producera papper sj&auml;lv. Hela projektet &auml;r ett grupparbete med sju personer per grupp. Varje person tilldelas sedan ett ansvarsomr&aring;de; projektledare, dokumentansvarig, testansvarig, kodansvarig, kvalitetsingenj&ouml;r mm. <p>
Gruppen tilldelas &auml;ven en handledare och en kund. Kunden kan vara en verklig kund fr&aring;n den stora verkligheten men kan lika g&auml;rna vara en doktorand p&aring; IDA. Efter ett f&ouml;rsta f&ouml;rklarande m&ouml;te med kunden och handledaren forts&auml;tter ett evigt skrivande av papper efter papper, och m&ouml;te efter m&ouml;te. Det &auml;r inte ovanligt att gruppen producerar dokument p&aring; &ouml;ver 200 sidor, de flesta ligger dock runt 50 - 100 sidor.<p>
Examinationen grundas dels p&aring; projektet och de dokument som ing&aring;r d&auml;r samt dels p&aring; en tentamen. Man kan v&auml;lja p&aring; att skriva en vanlig tenta och att g&ouml;ra en hemtenta. Hemtentan best&aring;r av en utredningsuppgift, som man f&aring;r tv&aring; veckor p&aring; sig att l&ouml;sa, och tv&aring; mindre uppgifter som ska l&ouml;sas under en dag. Skulle man vara missn&ouml;jd med resultatet p&aring; hemtentan kan man givetvis g&ouml;ra den vanliga tentan efter&aring;t.<p>
Ut&ouml;ver sj&auml;lva projektet ska man skriva och/eller f&ouml;rb&auml;ttra dokument &aring;t kursledningen. Dessa dokument anv&auml;nds av n&auml;sta &aring;rs studenter, och man kan sj&auml;lv ibland ha nytta av dokumenten fr&aring;n tidigare &aring;r. Man ska ocks&aring; genomf&ouml;ra presentationer, oppositioner och demonstrationer av sitt och andras projekt, och f&aring;r s&aring;ledes flera tillf&auml;llen att &ouml;va muntlig framst&auml;llning. &Auml;ven detta moment betygss&auml;tts och v&auml;gs in i projektbed&ouml;mningen.<p>
<H3><A NAME="HDR6">Ada och programspr&aring;k</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA11<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  <B>(Dav, Das, Pvp, Aut)</B><BR>
</DL>


Vill du snabbt l&auml;ra dig flera nya programspr&aring;k? Den h&auml;r kursen &auml;r en &ouml;versiktlig genomg&aring;ng av Algol, Simula, C, C++, Fortran, Modula 2 och Ada. Tonvikten l&auml;ggs p&aring; Ada, ett h&ouml;gniv&aring;spr&aring;k som karakt&auml;riseras av bra l&auml;sbarhet, stark typning, bra utvecklingsmilj&ouml; f&ouml;r st&ouml;rre program, praktisk felhantering och funktioner f&ouml;r parallell programmering.<p>
Under f&ouml;rel&auml;sningarna f&aring;r du en gedigen genomg&aring;ng av varje programspr&aring;ks syntax och semantik. F&ouml;rel&auml;saren anv&auml;nder sig p&aring; traditionellt vis av OH-material, som du ocks&aring; f&aring;r ut som kopior. F&ouml;rel&auml;sningarna kan tyckas bli ganska monotona, eftersom varje spr&aring;k presenteras v&auml;l strukturerat d&auml;r varje funktion och specialfall tas upp och det g&auml;ller att du h&aring;ller dig vaken s&aring; att du inte b&ouml;rjar blanda ihop de olika programspr&aring;ken.<p>
De tre laborationerna utf&ouml;rs i Simula, Ada och C++. De &auml;r inte s&aring; knepiga men ger en mycket bra insikt i de tre programspr&aring;ken.<p>
Kurslitteraturen best&aring;r av tv&aring; tjocka b&ouml;cker: en om Ada-programmering och en som behandlar olika programspr&aring;k. Den sistn&auml;mnda behandlar en m&auml;ngd begrepp, t ex abstraktion, en variabels r&auml;ckvidd och livsl&auml;ngd, ortogonalitet, olika typer av parameter&ouml;verf&ouml;ring och typomvandling.<p>
<H3><A NAME="HDR7">Teknisk och ekonomisk utv&auml;rdering  av datorsystem</A></H3>
Kurskod: <p>

<DL>
<DD>TDEI33<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Pvp)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF10168">Industriell ekonomi, grundkurs (sidan 1)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI>IT, kommunikation och organisationsdesign<BR>
</UL>


Detta &auml;r en kurs som l&auml;ses fr&auml;mst av I:are och D:are. En stor del av kursen inriktar sig p&aring; att l&auml;ra ut en metod f&ouml;r inf&ouml;rande av standardsystem, GENAST-modellen. Undervisningen &auml;r f&ouml;rdelad p&aring; f&ouml;rel&auml;sningar, lektioner, en laboration och f&ouml;retagsbes&ouml;k. Examinationen best&aring;r av en rapport som skrivs i grupper om 3 till 5 personer.<p>
Kursen &auml;r intressant och ger avsedd kunskap, vidare best&aring;r arbetsgrupperna av b&aring;de D:are och I:are, vilket g&ouml;r att olika syns&auml;tt blandas. Tyv&auml;rr &auml;r projektuppgifternas kvalit&eacute; varierande. Kursen kan dock rekomenderas eftersom inneh&aring;llet &auml;r relevant.<p>
<H3><A NAME="REF68838">Databasteknik</A></H3>
Kurskod: <p>

<DL>
<DD>TDDB38<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>5  (Das, Pvp)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF46914">Diskret matematik och logik (sidan 39)</A><BR>

<LI><A HREF="Kurser.html#REF82359">Datastrukturer och algoritmer (DALG) (sidan 5)</A><BR>
</UL>


Kursen har ut&ouml;kats till 5 po&auml;ng och best&aring;r numera av tv&aring; delar med b&aring;de f&ouml;rel&auml;sningar och laborationer. <p>
I den f&ouml;rsta delen presenteras databashanteringssystem i allm&auml;nhet och relationsdatabaser i synnerhet. N&auml;stan alla relationsdatabassystem anv&auml;nder fr&aring;gespr&aring;ket SQL som g&aring;s igenom mycket grundligt. Denna f&ouml;rsta del ger mycket nyttig kunskap som direkt kan till&auml;mpas i andra kurser och s&aring; sm&aring;ningom i yrkeslivet.<p>
Den andra delen av kursen behandlar &auml;ldre typer av databassystem (hierarkiska och n&auml;tverksdatabaser) samt det allra senaste, objektorienterade och distribuerade databaser. I andra delen behandlas &auml;ven mer tekniska saker som fr&aring;geoptimering och synkronisering.<p>
F&ouml;rel&auml;sningarna i f&ouml;rsta delen &auml;r exemplariska. Det som till en b&ouml;rjan verkar sv&aring;rt f&ouml;rklaras med tydliga exempel och i ett lagom tempo. I andra delen &auml;r f&ouml;rel&auml;sningarna mer teoretiska. Att g&aring; p&aring; f&ouml;rel&auml;sningarna rekommenderas emellertid starkt f&ouml;r den som vill slippa lusl&auml;sa hela boken.<p>
Laborationerna i kursen ger bra &ouml;vning i anv&auml;ndningen av SQL och hur man organiserar information i relationsmodellen. Det finns &auml;ven en laboration med en objektorienterad databas vilken ger en glimt av vad som kan bli m&ouml;jligt i framtiden. Laborationerna &auml;r bra och kan faktiskt utf&ouml;ras p&aring; den tid som finns reserverad i schemat.<p>
Boken som h&ouml;r till kursen &auml;r en riktig tegelsten p&aring; &ouml;ver 800 sidor. Lyckligtvis &auml;r den inte n&ouml;dv&auml;ndig f&ouml;r att klara vare sig kursen eller tentan, det r&auml;cker gott med anteckningar fr&aring;n f&ouml;rel&auml;sningarna och det OH-material som delas ut. F&ouml;r den som &auml;r intresserad av databaser kan boken &auml;nd&aring; rekommenderas d&aring; den f&ouml;rutom teori &auml;ven ger m&aring;nga tips om hur man arbetar i praktiken.<p>
Sammantaget &auml;r kursen mycket bra. F&ouml;rutom att den verkligen l&auml;r ut hur databassystem fungerar ger den &auml;ven en hel del tankar kring problemen och m&ouml;jligheterna med client-server-tekniken. Den som senare l&auml;ser t ex distribuerade system kommer att k&auml;nna igen en hel del fr&aring;n denna kurs. Tyv&auml;rr har tentan en tendens till att fr&aring;ga om allt eller inget, antingen &auml;r fr&aring;gorna mycket enkla eller s&aring; handlar de om n&aring;got v&auml;ldigt smalt omr&aring;de. Tentan &auml;r emellertid det enda som &auml;r d&aring;ligt med kursen, resten &auml;r bra eller lysande. G&aring; denna kurs!<p>
<H3><A NAME="REF84928">Formella spr&aring;k och automatateori</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA89<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Das, Dav)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF46914">Diskret matematik och logik (sidan 39)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF79039">Kompilatorkonstruktion (sidan 11)</A><BR>
</UL>


Kursen &auml;r en introduktion till formella spr&aring;k och automatateori. Ett formellt spr&aring;k &auml;r en m&auml;ngd av str&auml;ngar, d&auml;r en str&auml;ng &auml;r en &auml;ndlig sekvens av symboler. Exempel p&aring; formella spr&aring;k &auml;r programspr&aring;k och matematiska uttryck. P&aring; f&ouml;rel&auml;sningarnas, som &auml;r mycket bra, g&aring;s teorin igenom. Kursen &auml;r v&auml;ldigt teoretisk och huvudproblemet &auml;r: Hur kan man p&aring; ett &auml;ndligt s&auml;tt definiera ett o&auml;ndligt spr&aring;k och hur kan man konstruera en automat som kan avg&ouml;ra om en given str&auml;ng tillh&ouml;r spr&aring;ket eller inte? Problemet har praktisk betydelse i kompilatorkonstruktion och design av programmeringsspr&aring;k.<p>
Kursen har nio lektioner som &auml;r inriktade p&aring; uppgiftsl&ouml;sning. Uppgifterna &auml;r ett bra komplement till f&ouml;rel&auml;sningarna och ger en &ouml;kad f&ouml;rst&aring;else f&ouml;r teorin som ibland kan vara lite sv&aring;rsm&auml;lt. Kursmaterialet best&aring;r av ett kompendium med lektionsuppgifter och boken &quot;Introduction to Automata Theory, Languages and Computation&quot; av Hopcraft och Ullman. Boken kan vara k&auml;nnas lite tung att komma in i men n&auml;r man v&auml;l gjort det &auml;r den bra. Allt som g&aring;s igenom p&aring; f&ouml;rel&auml;sningarna st&aring;r i boken men vissa avsnitt f&ouml;rklaras mycket b&auml;ttre p&aring; f&ouml;rel&auml;sningarna.<p>
F&ouml;rutom att bli godk&auml;nd p&aring; tentamen ska man f&aring;r att bli godk&auml;nd p&aring; kursen l&ouml;sa tv&aring; inl&auml;mningsuppgifter. Inl&auml;mningsuppgifterna &auml;r av samma typ som tentamensuppgifterna och ger en bra uppfattning om hur mycket man har f&ouml;rst&aring;tt av teorin.<p>
<H3><A NAME="REF79039">Kompilatorkonstruktion</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA37<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Das, Dav)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF82359">Datastrukturer och algoritmer (DALG) (sidan 5)</A><BR>

<LI><A HREF="Kurser.html#REF84928">Formella spr&aring;k och automatateori (sidan 10)</A><BR>
</UL>


M&aring;let &auml;r att man efter kursen ska f&ouml;rst principerna f&ouml;r konstruktion av kompilatorer, k&auml;nna till de verktyg som finns f&aring;r &auml;ndam&aring;let och veta hur minnet administreras i samband med exekveringen av program.<p>
En kompilator &auml;r ett mycket v&auml;l modulariserat system, modulerna kallas f&ouml;r faser.I de f&ouml;rsta faserna, lexikalisk, syntaktisk och semantisk analys, sker en analys av k&auml;llkoden. K&auml;llkoden transformeras till n&aring;gon intermedi&auml;r lagringsform, en kompakt representation av programmet som &auml;r oberoende av b&aring;de k&auml;llspr&aring;k och m&aring;lmaskin. I de avslutande faserna, kodoptimering och kodgenerering transformeras sedan intermedi&auml;rkoden till objektkod.<p>
Under f&ouml;rel&auml;sningarna g&aring;s kompilatorns uppbyggnad igenom, f&ouml;r varje fas tas flera alternativa implementationsmetoder upp. F&ouml;rutom kompilatorns faser tas felhantering, interpretatorer, kompilatorgeneratorer och bootstrapping upp. (Bootstrapping &auml;r en metod f&ouml;r att konstruera kompilatorer f&ouml;r nya maskinarkitekturer).<p>
Kursens tyngdpunkt ligger p&aring; laborationerna och de &auml;r ocks&aring; mycket v&auml;l genomt&auml;nkta. P&aring; laborationerna implementerar man en fullst&auml;ndig kompilator f&ouml;r ett Pascal liknande spr&aring;k, Diesel. Dieselkompilatorn skrivs i Pascal och &auml;r v&auml;ldigt enkel men det &auml;r en komplett kompilator. P&aring; varje laboration implementeras en av kompilatorns faser, det finns ett f&auml;rdigt labskelett med mycket f&auml;rdig kod s&aring; att man kan koncentrera sig p&aring; det viktigaste.<p>
De fyra lektionerna i kursen syftar till att f&ouml;rbereda laborationerna. Som vanligt i s&aring;dana h&auml;r kurser tar laborationerna v&auml;ldigt mycket tid men de &auml;r mycket v&auml;l genomarbetade och framf&ouml;rallt, givande. Ett bra tips, som borde vara en sj&auml;lvklarhet, &auml;r att l&auml;sa kursboken innan man g&ouml;r labbarna, det sparar mycket tid. Kursmaterialet best&aring;r av f&ouml;rel&auml;sningsanteckningar, laborationsmaterial och boken &quot;Compilers, Principles, Techniques and Tools&quot; av Aho, Sethi och Ullman. Boken &auml;r mycket bra och kan med f&ouml;rdel anv&auml;ndas som referensverk efter kursens slut.<p>
<H3><A NAME="HDR8">CASE</A></H3>
Kurskod: <p>

<DL>
<DD>TDDB15<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (Pvp)<BR>
</DL>


Ett CASE-verktyg (CASE = &quot;Computer Aided Software Engineering&quot;) &auml;r ett verktyg som ger datorst&ouml;d under systemutvecklingsprocessen. Det finns verktyg f&ouml;r alla faser under systemutvecklingsprocessen: analys, design, kodning, testning och underh&aring;ll. En del verktyg st&ouml;der endast en fas medan andra st&ouml;der flera faser.<p>
Kursen f&ouml;rs&ouml;ker ge en &ouml;versikt av metoder och principer bakom de CASE-verktyg som finns idag och behandlar bl a milj&ouml;er, principer och verktyg f&ouml;r st&ouml;d till programmering i projektgrupper. S&aring;dana programmeringsmilj&ouml;er ger st&ouml;d f&ouml;r versions- och konfigurationshantering i programutvecklingsprojekt. Dessutom ber&ouml;rs principer och metoder f&ouml;r generering och konstruktion av interaktiva och inkrementella st&ouml;dsystem f&ouml;r enskilda programmerare i sm&aring;skalig programmering, samt verktyg som hj&auml;lper anv&auml;ndaren att f&ouml;rst&aring; strukturen i komplexa programsystem.<p>
Under laborationerna f&aring;r man prova p&aring; tre olika verktyg, bl a Objectory SE som &auml;r ett mycket kraftfullt och inte helt trivialt verktyg f&ouml;r analys och design. Laborationerna &auml;r inte s&auml;rskilt sv&aring;ra utan &auml;r till f&ouml;r att man, genom att l&auml;sa n&aring;gra enklare uppgifter, ska f&aring; prova p&aring; olika funktioner hos verktygen f&ouml;r att se vad man kan anv&auml;nda dem till. Kurslitteraturen best&aring;r av ett antal aktuella artiklar p&aring; omr&aring;det av varierande kvalitet.<p>
<H3><A NAME="HDR9">Diskret simuleringsteknik</A></H3>
Kurskod: <p>

<DL>
<DD>TDTS27<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (Aut)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF82359">Datastrukturer och algoritmer (DALG) (sidan 5)</A><BR>

<LI><A HREF="Kurser.html#REF70084">Matematisk statistik, grundkurs (sidan 39)</A><BR>
</UL>


Diskret simuleringsteknik behandlar principer f&ouml;r simulering av system d&auml;r h&auml;ndelser intr&auml;ffar diskret i tiden. Kursuppl&auml;ggningen &auml;r traditionell med f&ouml;rel&auml;sningar, lektioner och laborationer, och examinationen sker genom laborationerna och en tentamen.<p>
F&ouml;rel&auml;sningarna &auml;gnas &aring;t genomg&aring;ng av metoder och tillv&auml;gag&aring;ngss&auml;tt vid simulering, olika simuleringsspr&aring;k, resultatanalys, slumptalsgenerering, statistiska problem, parallellsimulering m m. F&ouml;rel&auml;sningarna inneh&aring;ller en del repetition fr&aring;n matematisk statistik och processprogrammering.<p>
P&aring; lektionerna g&aring;s simuleringsspr&aring;ket SIMULA och simuleringspaketet DEMOS igenom. Laborationerna utf&ouml;rs i DEMOS, som &auml;r en utvidgning av SIMULA. Den f&ouml;rsta laborationen best&aring;r av n&aring;gra mindre uppgifter f&ouml;r att man ska f&aring; bekanta sig med DEMOS. Den andra laborationen &auml;r ganska omfattande, men skoj och givande. D&aring; ska man konstruera en modell av en McDonalds-restaurang som man sedan implementerar och efter&aring;t ska resultatet av simuleringen analyseras.<p>
Avslutningsvis kan s&auml;gas att detta &auml;r en ganska intressant och inte alltf&ouml;r sv&aring;r kurs.<p>
<H3><A NAME="HDR10">Systemutveckling, teori och till&auml;mpning</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA12<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Pvp)<BR>
</DL>


Denna kurs skall ge grundl&auml;ggande kunskaper om systemutvecklingsprocesser. S&auml;rskilt behandlas olika arbetsmetoder f&ouml;r de inledande och analyserande faserna samt f&ouml;r projektledning. Olika metoder f&ouml;r f&ouml;rstudier, specifikationer, systemering och kvalitetss&auml;kring tas upp. Dessutom behandlas metoder f&ouml;r dokumentation och f&ouml;rvaltning av programvara.<p>
Kursen &auml;r uppdelad i en teoretisk och en praktisk del. I den teoretiska delen, som best&aring;r av f&ouml;rel&auml;sningar och seminarier, g&ouml;rs en genomg&aring;ng av kursens centrala delar. Detta inneb&auml;r bl a genomg&aring;ng av en programvaras livscykel, styrning och ledning av programutvecklingsprocessen och olika kvalitetsaspekter. Den praktiska delen av kursen best&aring;r av tv&aring; delmoment. Det f&ouml;rsta &auml;r ett studiebes&ouml;k hos ett f&ouml;retag och en intervju av en projektledare eller motsvarande ang&aring;ende deras principer och metoder f&ouml;r systemutveckling. Denna uppgift genomf&ouml;rs vanligtvis i grupper om tv&aring;. I det andra delmomentet arbetar man enskilt med att skriva en st&ouml;rre rapport i ett valt f&ouml;rdjupnings&auml;mne. Rapporterna sammanst&auml;lls i ett kompendium, vilket sedan anv&auml;nds av n&auml;sta &aring;rs kursdeltagare.<p>
<H3><A NAME="HDR11">M&auml;nniska-datorinteraktion (MDI)</A></H3>
Kurskod: <p>

<DL>
<DD>TDDB10<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2,5  (Pvp)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF15137">Programutvecklingsmetodik och programmeringsprojekt (PUM) (sidan 7)</A><BR>
</UL>


Syftet med kursen &auml;r att skapa intresse f&ouml;r och ge grundl&auml;ggande kunskap om anv&auml;ndbarhetsorienterad systemutveckling.<p>
Kursen &auml;r uppdelad i fyra delmoment: anv&auml;ndbarhet, design, prototyping och ett mindre projekt. I anv&auml;ndbarhetsdelen behandlas hur man definierar och m&auml;ter anv&auml;ndbarhet hos datorsystem. Man f&aring;r till&auml;mpa n&aring;gra metoder p&aring; ett befintligt system och presentera resultaten b&aring;de muntligt och skriftligt. Under designdelen utf&ouml;r man ett antal &ouml;vningar med syfte att dels f&aring; en viss f&auml;rdighet i design av anv&auml;ndargr&auml;nssnitt och dels att f&aring; &ouml;va v&auml;xlingen mellan att skapa och att reflektera &ouml;ver det man skapat. Vid prototypningen utforskar man n&aring;gra verktyg f&ouml;r att skapa en prototyp av sin design. Under den sista delen, projektet, arbetar man i en grupp tillsammans med teknologer och systemvetare med att l&ouml;sa en uppgift som g&aring;r ut p&aring; att studera en milj&ouml; som ska datoriseras. Ett f&ouml;rslag till design av ett anv&auml;ndargr&auml;nssnitt ska presenteras muntligt.<p>
Den h&auml;r kursen saknar, som v&auml;l &auml;r, tentamen. Ist&auml;llet sker kontinuerlig examination genom att varje delmoment i kursen betygs&auml;tts utifr&aring;n hur v&auml;l man uppn&aring;tt m&aring;len med kursen. M&aring;len &auml;r: att man ska bli entusiastisk f&ouml;r och intresserad av omr&aring;det m&auml;nniska-datorinteraktion, att man ska f&aring; en viss handlingsberedskap d v s att man f&aring;r k&auml;nnedom om olika filosofier, metoder och verktyg, samt att man utvecklar ett kritiskt f&ouml;rh&aring;llningss&auml;tt till metoder och verktyg och &auml;ven till de datorsystem som utvecklas med hj&auml;lp av dem. F&ouml;r varje moment har m&aring;len specificerats lite tydligare. <p>
Den h&auml;r kursen kan varmt rekommenderas, eftersom omr&aring;det m&auml;nniska-datorinteraktion blir allt viktigare. Kursen &auml;r verkligen utformad p&aring; ett vettigt s&auml;tt med tanke p&aring; kursinneh&aring;llet och kursm&aring;len. Kursledningen &auml;r mycket entusiastisk och uppgifterna &auml;r v&auml;ldigt stimulerande. <p>
<H3><A NAME="REF51182">Distribuerade system</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA67<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>1,5  (Das)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF71272">Processprogrammering (sidan 6)</A><BR>
</UL>


Vad &auml;r egentligen ett distribuerat datorsystem? Hur ser det ut ut&aring;t och hur fungerar kommunikation och internt arbete i ett s&aring;dant system? Detta &auml;r kursens huvudfr&aring;gor som besvaras under kursens g&aring;ng. Huvuddelen av kursen &auml;r en beskrivning av de komponenter som beh&ouml;vs f&ouml;r att bygga upp ett distribuerat datorsystem och tillsammans med dessa komponenter tas n&aring;gra existerande system upp till beskrivning.<p>
Kursen i sig best&aring;r av en renodlad litteraturstudie d&auml;r det ing&aring;ende materialet &auml;r en bok och ett kompendium med artiklar av varierande kvalitet. Boken &auml;r mycket l&auml;ttl&auml;st och v&auml;lstrukturerad och ger f&ouml;rst en snabb orientering inom omr&aring;det f&ouml;r att sedan g&aring; in p&aring; detaljer som r&ouml;r kommunikation, filhantering och transparens i distribuerade system.<p>
Inledningsvis &auml;r niv&aring;n i kursen p&aring; ett allm&auml;nt plan och distribuerade system diskuteras utifr&aring;n stora komponenter som terminaler, servers, arbetsstationer och n&auml;tverk men ganska snabbt byts detta mot en mer detaljerad niv&aring; d&auml;r det beskrivs hur filtj&auml;nster skall anropas, vilka parametrar som kr&auml;vs, i vilken ordning anrop skall ske och vilka resultat som l&auml;mnas. Ytterligare detaljer som tas upp &auml;r hur och var filer skall lagras samt hur hanteringen av filkopior kan g&ouml;ras.<p>
D&aring; det inte finns n&aring;gra laborationer i kursen, vilket k&auml;nns som en brist, kan det i bland vara sv&aring;rt att se hur vissa saker fungerar i praktiken. Samtidigt m&aring;ste man vara medveten om att det &auml;r sv&aring;rt att &aring;stadkomma bra laborationer inom den tidsram som finns f&ouml;r kursen. Syftet med kursen &auml;r nog inte att ge n&aring;gon helt&auml;ckande beskrivning av alla detaljer som m&aring;ste hanteras i ett distribuerat operativsystem, &auml;ven om det syftet n&auml;mns i studiehandboken. Det finns fr&aring;gor som l&auml;mnas &aring;t andra kurser att besvara. <p>
<H3><A NAME="REF59540">Expertsystem, metodik och verktyg</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA66<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (Dag, Pvp, Dav)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF79438">Artificiell intelligens (AI) (sidan 7)</A><BR>
</UL>


Kursen ges av professor Sture H&auml;gglund och syftar till att demonstrera och diskutera olika typer av expertsystem som anv&auml;nds kommersiellt idag. Den &auml;r med andra ord v&auml;ldigt yrkesinriktad.<p>
I kursen ing&aring;r en f&ouml;rel&auml;sningsserie, en laborationsserie och ett projektarbete. Det finns ingen tenta, utan man har ist&auml;llet inf&ouml;rt obligatorisk n&auml;rvaro p&aring; f&ouml;rel&auml;sningarna. P&aring; laborationerna demonstreras fyra olika typer av expertsystem, men man f&aring;r aldrig tillf&auml;lle att f&ouml;rdjupa sig i n&aring;gra sv&aring;rare uppgifter. Det &auml;r ist&auml;llet meningen att huvudparten av arbetet ska l&auml;ggas p&aring; projektarbetet, som man utf&ouml;r tv&aring; och tv&aring;. I detta projekt ska man leta r&auml;tt p&aring; en expert i sin omgivning och g&ouml;ra en f&ouml;rstudie inf&ouml;r ett eventuellt expertsystem. Resultatet ska l&auml;ggas fram vid ett seminarium och som en skriftlig rapport.<p>
Till st&ouml;d f&ouml;r arbetet finns en kursbok, &quot;Creating Expert Systems for Business and Industry&quot;, som &auml;r skriven av n&aring;gra optimister inom branschen - Hammon och Sawyer. Boken &auml;r till&auml;mpningsinriktad och ger, vid sidan av n&ouml;dv&auml;ndig teori, m&aring;nga r&aring;d om hur man f&aring;ngar expertkunskap och hur man kan formalisera denna p&aring; en form anv&auml;ndbar f&ouml;r ett expertsystem.<p>
Projektuppgiften kan ta en hel del tid, i &ouml;vrigt &auml;r detta en kurs som &auml;r menad att visa p&aring; hur expertsystem anv&auml;nds kommersiellt. Kursen &auml;r v&auml;rd att delta i f&ouml;r m&auml;nniskor med intresse f&ouml;r dessa fr&aring;gor. <p>
<H3><A NAME="REF91839">Datorarkitektur (DARK)</A></H3>
Kurskod: <p>

<DL>
<DD>TDTS51<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>1,5   (Das)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF79911">Datorteknik D (sidan 26)</A><BR>

<LI><A HREF="Kurser.html#REF71272">Processprogrammering (sidan 6)</A><BR>
</UL>


Kursen &auml;r en ganska bred kurs som behandlar allt fr&aring;n mjukvara till h&aring;rdvara och g&aring;r fr&aring;n l&aring;g till h&ouml;g niv&aring;. Datorarkitekturskursen behandlar hur en dator &auml;r uppbyggd f&ouml;r att bli s&aring; optimal som m&ouml;jligt. Det kan g&auml;lla pipelining av instruktionsexekvering, d v s att man delar upp instruktionerna i delar och l&aring;ter olika delar av processorn ta hand om var sin del och d&auml;refter skicka instruktionen vidare till n&auml;sta processordel. Optimering kan ske med olika m&aring;nga pipelinesteg och olika hastigheter p&aring; delarna. Kursen tar &auml;ven en titt p&aring; multiprocessorsystem, parallellism, minneshantering och vektormaskiner. Fr&aring;gor om praktiska gr&auml;nser f&ouml;r ber&auml;kningskapacitet eller om flera processorer kan ge h&ouml;gre kapacitet, &auml;r med som en del i kursen. Kurslitteraturen best&aring;r av en tjock engelsk bok. Dessutom tillkommer ett kompendium med kopior p&aring; de overheadbilder som fladdrar f&ouml;rbi under f&ouml;rel&auml;sningarna. Dessv&auml;rre har f&ouml;rel&auml;saren ofta br&aring;ttom att visa alla bilder s&aring; en f&ouml;rel&auml;sning kan l&auml;tt bli suddig.<p>
<H3><A NAME="REF55529">Datorst&ouml;dd elektronikkonstruktion</A></H3>
Kurskod: <p>

<DL>
<DD>TDTS80<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Das, Elk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF79911">Datorteknik D (sidan 26)</A><BR>
</UL>


Med den alltj&auml;mt &ouml;kande utvecklingen av datorer och elektronik beh&ouml;vs det verktyg som g&ouml;r arbetet l&auml;ttare. CAD (Computer Aided Design) och CAE (Computer Aided Engineering) &auml;r fullst&auml;ndigt n&ouml;dv&auml;ndiga n&auml;r det g&auml;ller konstruktion av st&ouml;rre datorsystem men de medf&ouml;r ocks&aring; vissa problem som belyses i kursen.<p>
Utveckling sker p&aring; flera olika niv&aring;er. Kiselniv&aring; vid konstruktion av kundanpassade integrerade kretsar, sk VLSI (Very Large Scale Integration) och kretskortsniv&aring; n&auml;r det g&auml;ller att placera ut de olika kretsarna i en konstruktion. N&aring;gra av de st&ouml;rre problemen n&auml;r det g&auml;ller elektronikkonstruktion &auml;r konsten att dra ledningar mellan alla enheter utan att dessa korsas eller ligger s&aring; n&auml;ra varandra att det blir &ouml;verh&ouml;rning eller andra st&ouml;rningar i systemet.<p>
Laborationen &auml;r ganska givande ur ett st&ouml;rre perspektiv. Dessv&auml;rre gick laborationen 1992-93, till st&ouml;rre delen, ut p&aring; att l&auml;ra sig ett system best&aring;ende av tv&aring; program d&auml;r programmerarna aldrig h&ouml;rt talas om anv&auml;ndargr&auml;nssnitt. Det &auml;r inte speciellt v&auml;nliga ord men programmen i sig &auml;r inte heller v&auml;nliga mot de studerande. F&ouml;rel&auml;sningarna tar upp olika metoder att konstruera elektronik p&aring; och olika algoritmer f&ouml;r placering och linjedragning.<p>
Kursboken &auml;r ett d&aring;ligt hopkok av artiklar och blir r&ouml;rig redan efter fj&auml;rde sidan. F&ouml;rel&auml;saren f&ouml;redrar dessutom den klassiska overheadmetoden f&ouml;r att g&ouml;ra allting &auml;nnu r&ouml;rigare. Som tur &auml;r finns ett kompendium med kopior p&aring; alla overheadbilder.<p>
<H3><A NAME="HDR12">Lingvistik</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA94<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (valfri)<BR>
</DL>


Lingvistik &auml;r en kurs f&ouml;r C1 som finns med i humaniorablocket f&ouml;r D4. Den syftar till att ge en f&ouml;rst&aring;else f&ouml;r hur kommunikation mellan individer g&aring;r till, fr&auml;mst d&aring; genom textanalys. Grammatik ing&aring;r som en del, men &auml;ven mer allm&auml;nna resonemang om vad som h&auml;nder n&auml;r personer talar med varandra, hur ord bildas och f&ouml;r&auml;ndras och vad som skiljer en samling l&ouml;sryckta meningar fr&aring;n en sammanh&auml;ngande text. Dessutom ing&aring;r en historisk &aring;terblick p&aring; &auml;mnet.<p>
Kurslitteraturen best&aring;r av en bok som heter &quot;Nusvensk grammatik&quot; och n&aring;gra kompendier utgivna av G&ouml;teborgs universitet. De sistn&auml;mnda skrifterna ing&aring;r tydligen i grundutbildningen av lingvister d&auml;r och &auml;r r&auml;tt kr&auml;vande att l&auml;sa. F&ouml;rel&auml;sningarna &auml;r ledda av Robert Hirsch som &auml;r trevlig att lyssna p&aring; och f&ouml;rel&auml;sningarna &auml;r d&auml;rmed ok. I kursen ing&aring;r ocks&aring; ett par l&auml;tta datorlaborationer d&auml;r man skriver en enkel grammatik f&ouml;r svenska spr&aring;ket i ett Lisp-system. Det &auml;r kanske sv&aring;rt att motivera vad man skulle beh&ouml;va denna kurs till inom D-linjens ram, om man inte vill specialisera sig mot AI-till&auml;mpningar som t ex naturligt spr&aring;k. &Auml;r man intresserad av spr&aring;k kan kursen tj&auml;na som en v&auml;rdefull genomg&aring;ng av grammatiken, och dessutom f&aring;r man ett lite annorlunda perspektiv p&aring; vad kommunikation &auml;r.<p>
<H3><A NAME="REF62543">Logikprogrammering </A></H3>
Kurskod: <p>

<DL>
<DD>TDDA41<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4,5  (Dav)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF55185">Programmering i inkrementellt system (PINK) (sidan 4)</A><BR>
</UL>


Logikprogrammering l&auml;r ut PROLOG, som &auml;r det f&ouml;rsta programspr&aring;ket som skapades f&ouml;r att f&ouml;ra logiska resonemang p&aring; datorer. Kursen &auml;r ingen programmeringskurs utan l&auml;gger tonvikten vid hur logik fungerar och hur den m&aring;ste utformas f&ouml;r att vara ber&auml;kningsbar med en algoritm.<p>
F&ouml;rel&auml;sningarna koncentrerar sig n&auml;stan uteslutande p&aring; detta. Kursens labbar &auml;r mer praktiskt inriktade p&aring; att l&ouml;sa uppgifter i PROLOG, och det finns ett antal lektioner d&auml;r grunderna i spr&aring;ket l&auml;rs ut. Mycket av kursen g&aring;r ut p&aring; att l&auml;ra sig att t&auml;nka ut hur ett problem m&aring;ste formuleras f&ouml;r att kunna beskrivas med logik, n&aring;got som inte &auml;r trivialt. En hel del tid g&aring;r d&auml;rf&ouml;r &aring;t f&ouml;r att komma ig&aring;ng med laborationerna.<p>
Tentamen f&ouml;ljer det allm&auml;nna m&ouml;nstret f&ouml;r kursen och best&aring;r av ett f&aring;tal renodlade programmeringsuppgifter. Tonvikten l&auml;ggs ist&auml;llet vid vad som h&auml;nder bakom sj&auml;lva exekveringen av ett program, d v s hur datorn b&auml;r sig &aring;t f&ouml;r att s&ouml;ka l&ouml;sningar p&aring; fr&aring;gor som uppkommer vid k&ouml;rningen. En del av tentan bygger p&aring; standardl&ouml;sningar f&ouml;r olika problem som t ex state-space-search vid AI-till&auml;mpningar. Kursen &auml;r kr&auml;vande eftersom den bygger p&aring; nya begrepp som tar tid att ta till sig. D&auml;remot &auml;r sj&auml;lva materialet som behandlas inte avskr&auml;ckande stort. Avslutningsvis ska s&auml;gas att man b&ouml;r ha f&ouml;rst&aring;tt det centrala i Logik, grundkurs f&ouml;r att klara av det hela.<p>
<H3><A NAME="REF30138">Data- och programstrukturer (DPS)</A></H3>
Kurskod: <p>

<DL>
<DD>TDDA69<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (Dav, Das, Pvp)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF55185">Programmering i inkrementellt system (PINK) (sidan 4)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF62543">Logikprogrammering (sidan 16)</A><BR>

<LI>Programmeringsteori<BR>
</UL>


Kursen str&auml;cker sig &ouml;ver tv&aring; perioder och inneh&aring;ller en omfattande laborationsserie vid sidan av en f&ouml;rel&auml;sningsserie. I kursen ges en &ouml;versikt av olika datavetenskapliga begrepp som ber&ouml;r egenskaperna hos programspr&aring;k. Man tittar bl a p&aring; olika typer av parameter&ouml;verf&ouml;ring, olika typer av bindningar i Lisp-liknande spr&aring;k och skillnader mellan logikprogrammeringsspr&aring;k, imperativa spr&aring;k (t ex C) och funktionella spr&aring;k (t ex Lisp). Interpretatorer och kompilatorer tas ocks&aring; upp och diskuteras ur olika aspekter. Laborationsserien tar upp begreppen ovan och g&aring;r mest ut p&aring; att man ska komplettera redan given kod f&ouml;r att implementera olika varianter av t ex parameter&ouml;verf&ouml;ring. En dialekt av Lisp anv&auml;nds, och alla exempel p&aring; f&ouml;rel&auml;sningar och i litteraturen &auml;r ocks&aring; givna i Lisp. Kursboken &auml;r &quot;Structure and interpretation of computer programs&quot;, en mastig volym p&aring; &ouml;ver 500 sidor. De tv&aring; f&ouml;rsta kapitlen &auml;r en repetition av Pink-kursen, men det &ouml;vriga materialet &auml;r nytt.<p>
<H2><A NAME="HDR13">Institutionen f&ouml;r Fysik och M&auml;tteknik</A></H2>
<H3><A NAME="HDR14">Mekanik D</A></H3>
Kurskod: <p>

<DL>
<DD>TFFY50<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF75854">Analys D (sidan 37)</A><BR>
</UL>


Mekaniken tillh&ouml;r en av de kurser som flyttats p&aring; grund av de nya tematerminerna. Ist&auml;llet f&ouml;r att l&auml;sas i tv&aring;an serveras den nu ist&auml;llet tillsammans med Analys och Algebra i ettan. Den som gillade fysiken i gymnasiet kommer f&ouml;rmodligen att stortrivas med Mekaniken. Mycket k&auml;nns igen, men tack vare mer avancerade matematiska verktyg, s&aring; som vektorer ist&auml;llet f&ouml;r skal&auml;rer, har man m&ouml;jlighet att behandla alla moment mer ing&aring;ende.<p>
Kurslitteraturen best&aring;r av en av en tolvhundra sidors tegelsten med det v&auml;l valda namnet &quot;Physics&quot;. Examinatorn, Roland Ribberfors, presenterar dock allt relevant stoff p&aring; sina minst sagt hektiska och t&auml;mligen underh&aring;llande f&ouml;rel&auml;sningar. Ribberfors har ocks&aring; skrivit svenska sammanfattningar av b&aring;de mekaniken och v&aring;gr&ouml;relsel&auml;ran. <p>
Efter halva kursen ges en kontrollskriving i form av en hemtenta, som l&ouml;ses enskilt (n&aring;ja) &ouml;ver en helg. Denna kan ge upp till fyra v&auml;lbeh&ouml;vliga bonuspo&auml;ng p&aring; tentamen. <p>
I andra halvan av kursen generaliseras mekaniken till tre dimensioner och stela kroppens dynamik, v&aring;gr&ouml;relsel&auml;ra och lite relativitetsteori avhandlas i snabb takt. V&auml;rt att n&auml;mnas kan ocks&aring; vara att f&ouml;r godk&auml;nd tentamen kr&auml;vs att tv&aring; av tio po&auml;ng givits p&aring; v&aring;gr&ouml;relsedelen.<p>
<H3><A NAME="REF16380">Elektromagnetism </A></H3>
Kurskod: <p>

<DL>
<DD>TFFY49<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF75854">Analys D (sidan 37)</A><BR>

<LI><A HREF="Kurser.html#REF42963">Linj&auml;r algebra (sidan 37)</A><BR>
</UL>


Kursen &auml;r en allm&auml;nbildande &ouml;versikt &ouml;ver elektromagnetismen och innefattar &auml;ven lite optik. Kursens uppl&auml;ggning skiljer sig lite fr&aring;n vanliga fysikkurser genom att hela kursen bygger p&aring; Maxwells fyra ekvationer, ur dessa h&auml;rleds hela elektrostatiken och magnetostatiken. Kursen upplevs av de flesta som lite utanf&ouml;r huvud&auml;mnena, men v&auml;ldigt intressant och givande. Detta mycket tack vare f&ouml;rel&auml;saren Lars Engstr&ouml;m som har ett mycket engagerande s&auml;tt att f&ouml;rel&auml;sa.<p>
Kursen till&auml;mpar ocks&aring; en del av analysen och ger p&aring; s&aring; s&auml;tt en kanske v&auml;lbeh&ouml;vlig uppfriskning av analysen. Kursmaterialet &auml;r skrivet av f&ouml;rel&auml;saren och &auml;r mer eller mindre hans egna f&ouml;rel&auml;sningsanteckningar och blir ibland lite kortfattade.<p>
<H3><A NAME="HDR15">Modern fysik D</A></H3>
Kurskod: <p>

<DL>
<DD>TFFY13<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF16380">Elektromagnetism (sidan 18)</A><BR>
</UL>


Efter denna kurs &auml;r det enligt Lars Engstr&ouml;m, som &auml;r examinator och f&ouml;rel&auml;sare i kursen, meningen att man ska kunna f&ouml;lja en artikel i &auml;mnet och kanske till och med v&aring;ga sig in i en diskussion. Kursen ger en mycket kort &ouml;versikt om utvecklingen inom fysiken efter &aring;r 1900. F&ouml;rel&auml;sningarna h&aring;lls som tidigare n&auml;mnts av Lars Engstr&ouml;m, som &auml;r mycket engagerad och duktig. Han har ocks&aring; skrivit boken, vilket g&ouml;r att f&ouml;rel&auml;sningarna f&ouml;ljer boken mycket v&auml;l och att inte mycket nytt tillf&ouml;rs. Trots detta &auml;r det en god id&eacute; att g&aring; p&aring; f&ouml;rel&auml;sningarna, eftersom man d&aring; f&aring;r en bra f&ouml;rklaring av kursens inneh&aring;ll, s&auml;rskilt de delar som kan vara lite kr&aring;ngliga. Boken &auml;r mycket bra och l&auml;mpar sig &auml;ven f&ouml;r sj&auml;lvstudier eftersom den &auml;r skriven p&aring; ett enkelt och l&auml;ttfattligt s&auml;tt. Kursen har endast n&aring;gra f&aring; lektioner, s&aring; det g&auml;ller att sj&auml;lv planera sina studier p&aring; ett vettigt s&auml;tt.<p>
Kursen har en enda laboration, denna &auml;r ganska enkel att f&ouml;rst&aring; och f&ouml;rberedelseuppgifterna &auml;r inte sv&aring;ra. Till viss del s&aring; k&auml;nns det som om det var lite f&ouml;r mycket som redan var iordningst&auml;llt och att allt man skulle g&ouml;ra var att l&auml;sa av det som stod p&aring; olika instrument.<p>
<H3><A NAME="REF26287">Halvledarteknik D</A></H3>
Kurskod: <p>

<DL>
<DD>TFFY32<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (Elk)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF29924">VLSI-konstruktion (sidan 20)</A><BR>
</UL>


Det h&auml;r &auml;r en av de intressantare kurserna i fyran. Den ger en mer kemisk inblick i hur man tillverkar och tar fram olika halvledarmaterial. Man f&aring;r en bra f&ouml;rklaring till de fysiska fenomen som uppst&aring;r i komponenter som utnyttjar f&ouml;rdelarna att kombinera olika dopningar av halvledare.<p>
I kursen f&aring;r man r&auml;kna p&aring; elektroner och h&aring;l, genombrottsp&auml;nningar och temperaturberoende. N&auml;r man sedan s&auml;tter ihop tv&aring; halvledare f&aring;r man en diod och det ger nya ber&auml;kningar. S&auml;tter man ihop tre halvledare (tv&aring; dioder) blir det en transistor. D&aring; r&auml;cker det inte med elektroner och h&aring;l, utan man m&aring;ste l&auml;gga in klurigheter som diffusionsekvationer f&ouml;r minoritetsb&auml;rare. N&auml;r man tror att man l&auml;rt sig allt om dioder och transistorer b&ouml;rjar man fundera p&aring; vad de t&aring;l och vad som h&auml;nder om man av n&aring;gon outgrundlig anledning skulle f&aring; f&ouml;r sig att v&auml;nda p&aring; str&ouml;mmen genom dem.<p>
Vidare tittar man g&auml;rna p&aring; lavindioder och deras genombrottssp&auml;nningar, men roligast av allt &auml;r de halvledare som genom olika former av excitation ger ljus fr&aring;n sig, dessa kallar vi lysdioder och de bara m&aring;ste blinka! &Auml;r man riktigt duktig kan man f&aring; fram en lasrande diod s&aring; att man d&auml;refter kan bygga sig en CD-spelare. Transistorn tittar man sig ocks&aring; blind p&aring; i vissa stunder. Vad h&auml;nder om man vrider upp frekvensen och hur bygger man en transmissionsgrind? Till sist g&ouml;r man en grundlig spaning p&aring; CMOS (Complementary Metal-Oxide Semiconductor - som i sig &auml;r en felaktig beteckning eftersom de f&aring;tt namnet efter styret som tidigare tillverkades av en metalloxid men numera avgjort byggs upp av polykisel).<p>
Kurslitteraturen &auml;r bra eftersom den &auml;r specialskriven som studentlitteratur p&aring; svenska. Det g&ouml;r den l&auml;ttl&auml;st och l&auml;tt att f&ouml;rst&aring;. Till boken h&ouml;r ocks&aring; ett praktiskt h&auml;fte med &ouml;vningsfr&aring;gor och svar som bra behandlar alla delar i kursen. Kursen passar bra ihop med kurserna <A HREF="Kurser.html#REF55877">Analoga kretsar (sidan 30)</A> och Digitala kretsar som ges ungef&auml;r samtidigt. Man kan s&auml;ga att i den h&auml;r kursen ligger alla grunder till modern elektronik och optoelektronik. Kursen leder som en r&ouml;d tr&aring;d vidare till kursen VLSI-konstruktion.<p>
<H3><A NAME="REF29924">VLSI-konstruktion </A></H3>
Kurskod: <p>

<DL>
<DD>TFFY90<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Elk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF26287">Halvledarteknik D (sidan 19)</A><BR>

<LI>Digitala kretsar<BR>
</UL>


VLSI st&aring;r f&ouml;r Very Large Scale Integration och kursen ges p&aring; engelska eftersom examinatorn anser sig tala engelska b&auml;ttre &auml;n han talar svenska. Det g&ouml;r inte s&aring; mycket eftersom kursboken &auml;r skriven p&aring; engelska. Kursen &auml;r en ren laborationskurs som g&aring;r ut p&aring; att i en grupp tillverka en integrerad krets i CMOS-teknik med en VLSI-process. Under 1992 f&ouml;rekom projekt som att f&ouml;rs&ouml;ka bygga en 200 MHz multiplicerande processor, en signalprocessor f&ouml;r h&ouml;ghastighetssignalering, och d&aring; menar jag h&ouml;g, och en 32-bitars r&auml;knare som ska klara av 800 MHz. <p>
Det &auml;r en ganska rolig kurs eftersom man verkligen tillverkar n&aring;got ist&auml;llet f&ouml;r att g&ouml;ra allt p&aring; papper eller bara se siffror p&aring; en bildsk&auml;rm. Resultatet blir ett stiligt litet chip att st&auml;lla i hyllan, f&ouml;rhoppningsvis fungerar konstruktionen ocks&aring;.<p>
Bara f&ouml;r att man satt sig ner framf&ouml;r en CAD-maskin och ritat ett litet chip f&aring;r man dock inga po&auml;ng. Allt m&aring;ste redovisas b&aring;de skriftligt och muntligt och det &auml;r inte ovanligt att man f&aring;r s&auml;tta sig ner och plita in ett och annat ord p&aring; n&aring;gon ordbehandlare. I &ouml;vrigt tycker jag att kursen &auml;r v&auml;l v&auml;rd att g&aring;. <p>
<H3><A NAME="HDR16">Milj&ouml;kunskap</A></H3>
Kurskod: <p>

<DL>
<DD>TFM&Auml;84<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (valfri)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Flertalet milj&ouml;kurser p&aring; IFM.<BR>
</UL>


Kursen best&aring;r av f&ouml;rel&auml;sningar, exkursioner och ett avslutande seminarium. Varje f&ouml;rel&auml;sning har ett tema och ofta &auml;r f&ouml;rel&auml;sarna specialister p&aring; aktuellt omr&aring;de. F&ouml;rel&auml;sarna bjuds in fr&aring;n b&aring;de arbetslivet och h&ouml;gskolor, t ex f&ouml;rel&auml;ser forskare fr&aring;n TEMA.<p>
Kursen &auml;r den grundl&auml;ggande f&ouml;r de &ouml;vriga milj&ouml;kurserna p&aring; LiTH. I kursen tar man upp de milj&ouml;effekter som vatten, mark och luft drabbats av. Man kan s&auml;ga att kursen till en del repeterar den biologi som man l&auml;st tidigare, men med inriktning p&aring; dagens milj&ouml;problem. F&ouml;r att bli godk&auml;nd p&aring; kursen m&aring;ste man n&auml;rvaro p&aring; st&ouml;rre del av f&ouml;rel&auml;sningarna, f&ouml;lja med p&aring; tv&aring; av tre utflykter och delta i det avslutande seminariet. Vid seminariet diskuterar man det man g&aring;tt igenom under kursen. Det kan till exempel g&aring; till som f&ouml;ljande: Man delas in i grupper om tre till fyra personer som f&aring;r varsin h&ouml;g med tidningsartiklar. Dessa l&auml;ser man igenom och redovisar f&ouml;r &ouml;vriga p&aring; seminariet. Sedan diskuterar man lite om det som redovisats. Det kr&auml;vs inte n&aring;got direkt f&ouml;rarbete, men man b&ouml;r ha ett hum om det som tagits upp under f&ouml;rel&auml;sningsserien. Inneh&aring;llet i kursboken &auml;r mycket intressant men man m&aring;ste inte k&ouml;pa kursboken f&ouml;r att klara kursen. Ett tips &auml;r att l&aring;na boken p&aring; biblioteket.<p>
<H2><A NAME="HDR17">Institutionen f&ouml;r Konstruktion och Produktionsteknik</A></H2>
<H3><A NAME="HDR18">Arbetsvetenskap, grundkurs</A></H3>
Kurskod: <p>

<DL>
<DD>TMIE06<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (obligatorisk)<BR>
</DL>


Kursen ger en helhetsbild av en arbetsplats med inriktning p&aring; kollektivt anst&auml;llda. Till en viss del f&ouml;rbereder kursen sina deltagare p&aring; det ansvar man kan t&auml;nkas f&aring; om man arbetar i chefsst&auml;llning. Laborationsserien omfattar labbarna: buller och belysning, klimat, anv&auml;ndbarhet hos mjukvara och belastningsergonomi. Laborationerna &auml;r av empirisk karakt&auml;r och uppfyller sitt syfte. P&aring; lektionerna arbetar man i grupper, vilket &auml;r en mycket l&auml;mpad undervisningsform f&ouml;r denna kurs.<p>
I kursen ing&aring;r &auml;ven en arbetsplatsunders&ouml;kning. D&auml;r g&auml;ller det att till&auml;mpa sina nyf&ouml;rv&auml;rvade kunskaper f&ouml;r att unders&ouml;ka, bed&ouml;ma och ge synpunkter p&aring; en arbetssituation i det verkliga livet. Examinationen best&aring;r av ett obligatoriskt inslag i f&ouml;rberedelsen av arbetsplatsunders&ouml;kningen, en skriftlig rapport p&aring; arbetsplatsunders&ouml;kningen, en muntlig redovisning av samma rapport, samt godk&auml;nda laborationer. Kursen &auml;r v&auml;lgenomf&ouml;rd och uppfyller sitt syfte. Nackdelen &auml;r att den behandlar m&aring;nga sj&auml;lvklarheter, speciellt f&ouml;r den som arbetat eller praktiserat p&aring; ett verkstadsgolv. Dessutom ligger den i &aring;rskurs fyra, d&auml;r den f&aring;r konkurrera med m&aring;nga valfria kurser samt PUMen, detta g&ouml;r att den inte uppskattas efter f&ouml;rtj&auml;nst.<p>
<H2><A NAME="HDR19">Institutionen f&ouml;r Medicinsk Teknik</A></H2>
Samtliga kurser som ges av IMT p&aring; D-utbildningen tillh&ouml;r profilen Medicinsk Teknik. IMT &auml;r bel&auml;get p&aring; universitetssjukhuset och &auml;r en trevlig institution med varm atmosf&auml;r. N&auml;rheten till H&auml;lsouniversitetets bibliotek g&ouml;r att studierna blir mycket effektiva med tillg&aring;ng till ett rikt utbud av referenslitteratur.<p>
<H3><A NAME="REF81017">Medicin och teknik</A></H3>
Kurskod: <p>

<DL>
<DD>TBME50<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (Med)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Flertalet kurser p&aring; IMT.<BR>
</UL>


I &aring;rskurs tre l&auml;ser man Medicin och teknik som den f&ouml;rsta profilkursen i Medicinsk teknik. Tanken &auml;r att ge en introduktion till &auml;mnet och ge en &ouml;versikt p&aring; olika problemst&auml;llningar och tekniska hj&auml;lpmedel inom medicinsk diagnostik och terapi. Genom kursen f&aring;s en grundl&auml;ggande terminologi inom medicinen som ger dig m&ouml;jligheterna att f&ouml;rst&aring; spr&aring;ket som anv&auml;nds inom medicinen, (det &auml;r en hel del grekiska och latinska termer). I b&ouml;rjan av kursen ges ett patientfall som man f&aring;r f&ouml;lja, fr&aring;n olyckan i Vallarondellen genom sjukv&aring;rdskedjan till rehabilitering.<p>
Tv&aring; laborationer f&ouml;rgyller tillvaron; &quot;Arbetsprov&quot; och &quot;Registrering av EKG-signaler&quot;. Vid arbetsprovet f&aring;r en f&ouml;rs&ouml;ksperson cykla p&aring; en arbetscykel samtidigt som en del fysiologiska parametrar registreras. D&auml;refter g&ouml;rs en utv&auml;rdering av arbetsprovet (utvecklad effekt per kg kroppsvikt). Alla som m&ouml;nstrat vet ungef&auml;r vad det handlar om. Registreringen av EKG-signaler &auml;r en intressant och l&auml;rorik laboration d&auml;r en enkel trepunktsavledning p&aring; kroppen bygger upp en EKG-signal. <p>
<H3><A NAME="REF38335">Anatomi och fysiologi</A></H3>
Kurskod: <p>

<DL>
<DD>TBME02 <BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (Med)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Flertalet kurser p&aring; IMT.<BR>
</UL>


En mycket intressant kurs f&ouml;r de som &auml;r intresserade av hur kroppen &auml;r uppbyggd och hur dess delar fungerar. Kroppen &auml;r mycket komplicerad och efter denna kurs tycks det som ett under att allt fungerar. Ett axplock ur inneh&aring;llet &auml;r cellmetabolism, v&auml;vnadsl&auml;ra, r&ouml;relseapparaten, cirkulationssystemet, respirationssystemet, digestionssystemet, &auml;mnesoms&auml;ttning, uts&ouml;ndringsorganen, fortplantning, nervsystemet och sinnesorganen. Listan kan g&ouml;ras mycket l&auml;ngre men kursen ger mycket grundl&auml;ggande kunskaper i medicin, som beh&ouml;vs f&ouml;r ett djupare intr&auml;ngande i speciella medicinska omr&aring;den och f&ouml;r fortsatta studier i medicinsk teknik och medicinsk informationsbehandling. Det ges &auml;ven tillf&auml;lle att frivilligt bes&ouml;ka patologen under en obduktion.<p>
Tv&aring; laborationer &auml;r till f&ouml;r att f&aring; en djupare f&ouml;rst&aring;else av omr&aring;det; &quot;Nerv- och muskelfysiologi&quot; och &quot;Datorsimulering av cirkulationsfysiologi&quot;. Vid nerv- och muskelfysiologilaborationen stimulerar man olika nerver i avsikt att m&auml;ta den sensoriska och motoriska nervledningshastigheten. Tv&aring; nerver unders&ouml;ks, vilka kan vara sv&aring;ra att hitta eftersom v&aring;r anatomi &auml;r lite olika, och stimuleras var f&ouml;r sig med elektriska impulser. Den andra laborationen utf&ouml;rs framf&ouml;r en dator i avsikt att simulera cirkulationsfysiologin i kroppen. <p>
En riktigt rolig och l&auml;rorik kurs som ger vissa tankest&auml;llare; skulle man t ex kunna stimulera avslitna nerver (vid olycka) med elektriska impulser s&aring; att r&ouml;relsef&ouml;rm&aring;gan i t ex ben &aring;terf&aring;s?<p>
<H3><A NAME="REF44482">Analys av bioelektriska signaler</A></H3>
Kurskod: <p>

<DL>
<DD>TBMT11<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (Med)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF81017">Medicin och teknik (sidan 22)</A><BR>

<LI><A HREF="Kurser.html#REF38335">Anatomi och fysiologi (sidan 22)</A><BR>

<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF57375">Digitala filter (sidan 32)</A><BR>

<LI>M&auml;tdatasystem och signalbehandling<BR>
</UL>


Damma av de gamla kunskaperna i signalteori och du har stor beh&aring;llning av denna kurs. Kursen ger n&auml;mligen f&ouml;rdjupade kunskaper om olika metoder f&ouml;r signalanalys som &auml;r v&auml;sentliga f&ouml;r s&aring;v&auml;l diagnostik som medicinsk forskning. Utifr&aring;n fysikaliska modeller och empiri behandlas biosignalers egenskaper och f&ouml;r&auml;ndringar vid patologiska tillst&aring;nd. Termer som sampling, fouriertransform, effektspektrum etc &auml;r vardagsmat i kursen. F&ouml;rdjupning i avledningssystem vid EKG och neurofysiologi ing&aring;r liksom elektrostimulering, defibrillering, pacemakers etc. Hj&auml;rtats och centrala och perifera nervsystemets funktion g&aring;s igenom ordentligt liksom de metoder som finns f&ouml;r att registrera de signaler som alstras i dessa system.<p>
Givetvis ing&aring;r det &auml;ven h&auml;r en laboration, som &auml;r en heldagslab.<p>
<H3><A NAME="REF27791">Bildgenererande teknik inom medicinen</A></H3>
Kurskod: <p>

<DL>
<DD>TBMT12<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (Med)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF81017">Medicin och teknik (sidan 22)</A><BR>

<LI><A HREF="Kurser.html#REF38335">Anatomi och fysiologi (sidan 22)</A><BR>

<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>
</UL>


Detta &auml;r en kurs som &ouml;versiktligt g&aring;r igenom de teknologier som anv&auml;nds f&ouml;r att avbilda m&auml;nniskokroppen och f&ouml;r att visualisera fysiologiska f&ouml;rlopp. Radiobiologi och str&aring;lskydd samt nukle&auml;rmedicinska metoder ber&ouml;rs och de bildgenererande teknikerna som r&ouml;ntgen, datortomografi, magnetresonans, positronemmissionstomografi, ultraljud etc. Det ing&aring;r ocks&aring; teori bakom bildbehandling, bildkompression och s k PACS - Picture Archiving and Communicating Systems. Dessa teorier &auml;r mycket viktiga eftersom dagens tomografer genererar en hel del information, i storleksordningen 5-20 Mbyte per unders&ouml;kning.<p>
Laborationerna, som &auml;r tv&aring; till antalet behandlar r&ouml;ntgenteknik och PACS.<p>
<H3><A NAME="HDR20">Datorst&ouml;tt beslutsfattande inom medicinen</A></H3>
Kurskod: <p>

<DL>
<DD>TBMI05<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (Med)<BR>
</DL>


Den h&auml;r kursen ges av Avdelningen f&ouml;r medicinsk informatik, AMI, som har sina lokaler i en av flyglarna p&aring; Universitetssjukhusets huvudblock. Kursen best&aring;r av laborationer, projektarbete och tentamen.<p>
I kursen behandlas teorin bakom beslutsfattande och beslutsst&ouml;djande datorsystem inom medicinen.En orientering ges av de befintliga systemen inom sjukv&aring;rden som anv&auml;nds runt om i v&auml;rlden. Dessa system omfattar bl a journalhantering och diagnosst&ouml;d.<p>
I laborationerna stiftas bekantskap med n&aring;gra metoder f&ouml;r att ta s&aring; s&auml;kra beslut som m&ouml;jligt. I patientv&aring;rden kan ett snabbt och korrekt beslut vara livsavg&ouml;rande och det st&auml;ller h&ouml;ga krav p&aring; beslutsfattaren. Beslutsfattaren &auml;r i det h&auml;r fallet en kombination d&auml;r m&auml;nniskan tar beslut efter systemets r&aring;d.<p>
Projektarbetet inneb&auml;r en m&ouml;jlighet att f&ouml;rdjupa sig i n&aring;got delmoment och f&ouml;rhoppningvis hj&auml;lpa n&aring;gon av sjukhusets avdelningar att effektivisera arbetet.<p>
<H3><A NAME="HDR21">Fysiologiska tryck och fl&ouml;den</A></H3>
Kurskod: <p>

<DL>
<DD>TBMT21<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (Med)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF81017">Medicin och teknik (sidan 22)</A><BR>

<LI><A HREF="Kurser.html#REF38335">Anatomi och fysiologi (sidan 22)</A><BR>
</UL>


Hur beskriver man fysikaliskt tryck och fl&ouml;den i cirkulations-, andnings-, matsm&auml;ltnings- och uts&ouml;ndringsapparaten och vilka m&auml;ttekniker finns f&ouml;r dessa? Efter tentamen s&aring; kan du f&ouml;rhoppningsvis svara p&aring; dessa och m&aring;nga andra fr&aring;gor som r&ouml;r dessa omr&aring;den. <p>
Tre laborationer ing&aring;r i kursen; en &auml;r en heldagslaboration i blodgasanalys och respirationsfysiologisk &ouml;vervakning, och de tv&aring; &ouml;vriga i pulsoximetri och tryckgivarsystem.<p>
<H2><A NAME="HDR22">Institutionen f&ouml;r Systemteknik</A></H2>
<H3><A NAME="REF65119">Digitalteknik</A></H3>
Kurskod: <p>

<DL>
<DD>TSEA04<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (obligatorisk)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF95144">Digital konstruktion (DK) (sidan 25)</A><BR>

<LI><A HREF="Kurser.html#REF79911">Datorteknik D (sidan 26)</A><BR>
</UL>


F&ouml;rkunskaperna till denna kurs varierar ganska kraftigt. Vissa har l&auml;st ganska mycket p&aring; gymnasiet medan andra aldrig har syslat med det. Det g&aring;r dock fort att komma in i kursen och den &auml;r inte speciellt sv&aring;r. Kursen &auml;r inriktad p&aring; digitalteknikens anv&auml;ndande och inte s&aring; mycket p&aring; hur grindar och liknande &auml;r uppbyggt. &Ouml;vningarna blir mer och mer till&auml;mpade ju l&auml;ngre kursen g&aring;r och det &auml;r ofta l&auml;tt att se den praktiska nyttan av kunskaperna. Laborationerna f&ouml;rst&auml;rker ytterligare denna koppling med verkligheten - det &auml;r kul att se att det fungerar! <p>
Kursen kan delas in i tre delar. Den f&ouml;rsta behandlar fr&auml;mst kodning, boolesk algebra och minimeringsmetoder. I del tv&aring; tittar man p&aring; speciella kombinatoriska n&auml;t och minnen. Den sista delen handlar om sekvensn&auml;t,tillst&aring;ndsminimering och synkroniseringsproblem.<p>
<H3><A NAME="REF95144">Digital konstruktion (DK)</A></H3>
Kurskod: <p>

<DL>
<DD>TSEA31<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF65119">Digitalteknik (sidan 25)</A><BR>
</UL>


Kursen &auml;r en projektkurs som bygger p&aring; kursen i digitalteknik. Man f&aring;r praktiskt hantera olika digitala integrerade kretsar och oms&auml;tta en specifikation till en fungerande apparat. Kursen inleds med tre f&ouml;rel&auml;sningar som handlar allm&auml;nt hur man konstruerar och undviker problem i digitala system. D&auml;refter g&ouml;r gruppen ett blockschema p&aring; konstruktionen som &auml;r valfri, och l&auml;mnar in detta tillsammans med en komponentlista. Storleken p&aring; projekten varierar mellan 40-90 kapslar. Handledaren tilldelar varje grupp en labbplats med verktyg. Sedan &auml;r det bara k&ouml;ra ig&aring;ng att vira och testa block f&ouml;r block tills man har en fungerande apparat. N&auml;r man &auml;ntligen &auml;r klar och man kan stolt visa upp en fungerande apparat &auml;r det dags f&ouml;r examination som best&aring;r av en muntlig framst&auml;llning och en demonstration av apparaten.<p>
<H3><A NAME="REF79911">Datorteknik D</A></H3>
Kurskod: <p>

<DL>
<DD>TSEA18<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>5,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF65119">Digitalteknik (sidan 25)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF44955">Digital konstruktion med mikrodator (DKM) (sidan 26)</A><BR>

<LI><A HREF="Kurser.html#REF91839">Datorarkitektur (DARK) (sidan 15)</A><BR>

<LI><A HREF="Kurser.html#REF55529">Datorst&ouml;dd elektronikkonstruktion (sidan 15)</A><BR>

<LI><A HREF="Kurser.html#REF58374">Datas&auml;kerhetsmetoder (sidan 36)</A><BR>
</UL>


Dator teknik tillh&ouml;r &aring;rskurs 2 och ges p&aring; ISY. Denna kurs &auml;r en naturlig forts&auml;ttning p&aring; kursen i digitalteknik. I datortekniken g&aring;r man vidare och visar p&aring; hur mer komplicerade digitala kretsar &auml;r uppbyggda och principerna f&ouml;r hur man bygger digitala system, t.ex. datorer. N&auml;r det g&auml;ller datorer s&aring; n&ouml;jer man sig inte med att bara beskriva konstruktionen utan man beskriver &auml;ven de principer enligt vilka datorn i grunden arbetar. Hur datorn subtraherar, adderar och multiplicerar etc. bin&auml;ra tal, f&ouml;r att utf&ouml;ra de uppdrag vi ger den.<p>
Till kursen h&ouml;r ett antal laborationer d&auml;r man f&aring;r prova p&aring; hur man i praktiken anv&auml;nder digitala kretsar f&ouml;r att konstruerar system. Man f&aring;r &auml;ven prova p&aring; att skriva mikrokod och maskinkod och d&auml;rigenom fr&aring;n grunden definiera hur en dator skall arbeta. Denna kurs ger s&aring;ledes en grundl&auml;ggande inblick i hur datorer och &auml;ven andra digitala system &auml;r uppbyggda. Man kan under kursens g&aring;ng ibland (s&auml;rskilt under laborationerna) sl&aring;s med h&auml;pnad &ouml;ver att dagens s&aring; komplicerade datorer trots allt &auml;r s&aring; p&aring;litliga n&auml;r man bet&auml;nker hur mycket som egentligen skulle kunna g&aring; fel. <p>
<H3><A NAME="REF44955">Digital konstruktion med mikrodator (DKM)</A></H3>
Kurskod: <p>

<DL>
<DD>TSEA37<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF79911">Datorteknik D (sidan 26)</A><BR>
</UL>


DKM-kursen kan s&auml;gas vara en forts&auml;ttning p&aring; datorteknikslaborationerna, men h&auml;r utvidgat till ett projekt. Uppl&auml;ggningen av kursen p&aring;minner mycket om kursen digital konstruktion. I b&ouml;rjan av projektet h&aring;lls n&aring;gra allm&auml;nna f&ouml;rel&auml;sningar om konstruktionsmetodik samt vilken utrustning som finns att tillg&aring;. En designspecifikation p&aring; projektet l&auml;mnas sedan in av projektgrupperna best&aring;ende av 2-3 personer f&ouml;r att godk&auml;nnas av kursledningen. N&auml;r kursledningen godk&auml;nt projektspecifikationen l&auml;mnas nycklar till laborationslokalen och laborationsb&auml;nken ut samt de verktyg och komponenter som planerats att anv&auml;ndas f&ouml;r projektet.<p>
D&auml;refter intr&auml;der en projektfas av febril aktivitet d&aring; de glada teknologerna virar ihop kretsar och komponenter och fort och felfritt implementerar sin pekoralt provocerande programvara f&ouml;r styrning av detta elektroniska underverk. D&aring; det elektroniska alstret b&ouml;rjar visa tendenser till att uppf&ouml;ra sig i enlighet med vad som var avsett i designspecifikationen b&ouml;r arbetet med att f&auml;rdigst&auml;lla den tekniska rapporten p&aring;b&ouml;rjas. D&aring; projektet har f&auml;rdigst&auml;llts, provats och konstaterats fungera, samt rapportens text &ouml;verensst&auml;mmer med h&aring;rdvaran, best&auml;lles tid f&ouml;r muntlig framst&auml;llning och redovisning av projektet. Vid redovisningstillf&auml;llet redovisar flera grupper sina projekt f&ouml;r varandra, samt f&ouml;r examinatorn. Redovisningen best&aring;r av tv&aring; faser, en muntlig framst&auml;llning d&auml;r projektet beskrives samt en demonstrationsfas d&auml;r projektet demonstreras.<p>
Personligen tycker jag att detta var en rolig kurs, trots vissa problem och sena n&auml;tter. M&aring;nga anser dock att det &auml;r l&auml;ttf&ouml;rtj&auml;nta po&auml;ng i f&ouml;rh&aring;llande till andra laborationskurser, ty sv&aring;righeten p&aring; projektet best&auml;ms till stor del av teknologema sj&auml;lva<p>
<H3><A NAME="REF48763">Krets- och m&auml;tteknik</A></H3>
Kurskod: <p>

<DL>
<DD>TSDT63<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF75854">Analys D (sidan 37)</A><BR>

<LI><A HREF="Kurser.html#REF42963">Linj&auml;r algebra (sidan 37)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF86271">Kretsteori (sidan 27)</A><BR>
</UL>


Kursen &auml;r uppdelad i tre delar. F&ouml;rsta delen l&auml;r ut grundl&auml;ggande teknik f&ouml;r ber&auml;kningar p&aring; lik- och v&auml;xelstr&ouml;msn&auml;t, andra delen av kursen f&aring;r man l&auml;ra sig hur dioder och transistorer beter sig i olika n&auml;t. Man f&aring;r &auml;ven l&auml;ra sig tolka olika f&ouml;rst&auml;rkare och omvandla dessa till n&auml;t som &auml;r m&ouml;jliga att r&auml;kna p&aring;. Den sista delen &auml;r m&auml;ttekniken d&auml;r olika n&auml;tst&ouml;rningar och s&auml;tt att slippa ifr&aring;n dessa behandlas. Laborationerna p&aring; de f&ouml;rsta delarna i kursen &auml;r grundl&auml;ggande och bra. Den tredje delens laborationer &auml;r dock lite konstiga och sv&aring;rbegripliga.<p>
Tentan inneh&aring;ller tio stycken 1X2-fr&aring;gor p&aring; teori, samt n&aring;gra stora r&auml;kneuppgifter. Kursen &auml;r i princip en kortfattad repetition av ell&auml;ran i &aring;rskurs 3 p&aring; T-linjens elgren. Har man inte g&aring;tt elteknisk linje kan kursen upplevas som lite jobbig. Litteraturen &auml;r skriven av f&ouml;rel&auml;saren Sune S&ouml;derkvist och &auml;r kanske lite v&auml;l grundl&auml;ggande p&aring; vissa delar.<p>
<H3><A NAME="REF86271">Kretsteori</A></H3>
Kurskod: <p>

<DL>
<DD>TSDT70<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>7  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF48763">Krets- och m&auml;tteknik (sidan 27)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>

<LI><A HREF="Kurser.html#REF23036">Reglerteknik Y (sidan 29)</A><BR>
</UL>


Kursen best&aring;r av tv&aring; delar p&aring; vardera 3.5 po&auml;ng och h&aring;lls av Sune S&ouml;derkvist. Kursen behandlar tidskontinuerlig, del 1, resp tidsdiskret, del 2, signal- och systemanalys. Detta &auml;r framf&ouml;rallt en matematikkurs, d&auml;r elektriska system anv&auml;nds som exempel p&aring; teorin. Den matematik som l&auml;rs ut kommer att ligga till grund f&ouml;r m&aring;nga kurser i h&ouml;gre &aring;rskurser p&aring; ISY, t ex Signalteori och Reglerteknik. Fourierserier, Fouriertransform, Laplacetransform och differentialekvationer anv&auml;nds flitigt i del 1 och motsvarande f&ouml;r del 2 &auml;r Fourierserier, Fouriertransform, Z-transform och Differensekvationer. F&ouml;ljaktligen har du nytta av dina analyskunskaper.<p>
Undervisningen sker i form av f&ouml;rel&auml;sningar, lektioner och frivilliga dator&ouml;vningar. P&aring; lektionerna brukar det f&ouml;rst vara en kort repetition av teorin fr&aring;n f&ouml;rel&auml;sningen f&ouml;ljt av enskilt r&auml;knande ur exempelsamlingen. Dator&ouml;vningarna &auml;r fyra till antalet per del, och ger f&ouml;rsta uppgiften p&aring; respektive tentamen, vilket kan vara bra d&aring; m&aring;nga upplever tentamen som klurig. De genomf&ouml;rs m h a programmet Kretslab/Matlab och noggranna f&ouml;rberedelser &auml;r n&ouml;dv&auml;ndiga d&aring; tiden &auml;r sn&aring;lt tilltagen. L&auml;robok &auml;r S&ouml;derkvists &quot;Tidskontinuerliga signaler och system&quot;, del 1, och &quot;Tidsdiskreta signaler och system&quot; f&ouml;r del 2.<p>
<H3><A NAME="REF29650">Signalteori D</A></H3>
Kurskod: <p>

<DL>
<DD>TSIT66<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF86271">Kretsteori (sidan 27)</A><BR>

<LI><A HREF="Kurser.html#REF70084">Matematisk statistik, grundkurs (sidan 39)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF44482">Analys av bioelektriska signaler (sidan 23)</A><BR>

<LI><A HREF="Kurser.html#REF27791">Bildgenererande teknik inom medicinen (sidan 23)</A><BR>

<LI>Flertalet kurser p&aring; ISY.<BR>
</UL>


Kursen handlar om signaler, och hur dessa tar sig igenom system av samma slag som i kretsteorin. Men i signalteori studerar man stokastiska signaler och medelv&auml;rdesbildningar &ouml;ver dessa ist&auml;llet f&ouml;r deterministiska signaler, som i kretsteorin. I kursen behandlar man b&aring;de diskreta och kontinuerliga signaler. Signalteorin bygger mycket p&aring; kretsteorin, och vissa delar av kursen &auml;r repetiton av kretsteorin. Man k&auml;nner ocks&aring; till viss del igen sig i de nya delarna vilket g&ouml;r att kursen inte k&auml;nns s&aring; tung.<p>
F&ouml;rel&auml;sare och examinator &auml;r Anders Lindman; han &auml;r mycket duktig och visar stor entusiasm. Vidare g&ouml;r hans humor att f&ouml;rel&auml;sningarna blir underh&aring;llande. Det &auml;r ocks&aring; l&auml;tt att h&auml;nga med p&aring; f&ouml;rel&auml;sningarna och man l&auml;r sig v&auml;ldigt mycket. Laborationerna &auml;r tre stycken varav en &auml;r en h&aring;rdvarulaboration d&auml;r man f&aring;r koppla in olika signaler till flera slags filter och sedan studera utsignalen. De &ouml;vriga tv&aring; laborationerna &auml;r datorlabbar. Kurslitteraturen best&aring;r av ett teorikompendium och en exempelsamling. Eftersom det &auml;r f&ouml;rel&auml;saren sj&auml;lv som har skrivit dessa f&ouml;ljer de f&ouml;rel&auml;sningarna mycket v&auml;l.<p>
<H3><A NAME="REF23036">Reglerteknik Y </A></H3>
Kurskod: <p>

<DL>
<DD>TSRT12<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF70084">Matematisk statistik, grundkurs (sidan 39)</A><BR>

<LI><A HREF="Kurser.html#REF86271">Kretsteori (sidan 27)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF19027">Reglerteori (sidan 35)</A><BR>

<LI><A HREF="Kurser.html#REF11548">Modellering av industriella system (sidan 31)</A><BR>

<LI>m fl<BR>
</UL>


Kursen best&aring;r av f&ouml;rel&auml;sningar, lektioner och laborationer. Kurslitteraturen &auml;r bra och inneh&aring;ller en bok, kompendium med r&auml;kne&ouml;vningar, kompendium med svar till r&auml;kne&ouml;vningar och laborationsmaterial. Lektionerna ger mycket och fungerar s&aring; att assistenten r&auml;knar uppgiftera p&aring; tavlan och sedan f&aring;r studenterna st&auml;lla fr&aring;gor om l&ouml;sningen. Den beskrivna l&ouml;sningsg&aring;ngen &auml;r bra att l&auml;ra sig eftersom tentan blir mycket l&auml;ttare d&aring;.<p>
Laborationerna v&auml;ver samman praktik och teori p&aring; ett bra s&auml;tt. De ger en f&ouml;rst&aring;else f&ouml;r de begrepp som behandlas p&aring; lektioner och f&ouml;rel&auml;sningar. Innan man f&aring;r b&ouml;rja laborera m&aring;ste man dock skriva en dugga p&aring; det avsnitt laborationen behandlar och redovisa de f&ouml;rberedelseuppgifter laborationen inneh&aring;ller. P&aring; tentamen till&aring;ts kursboken som hj&auml;lpmedel vilket g&ouml;r att slutomd&ouml;met om denna kurs blir arbetskr&auml;vande men bra. <p>
<H3><A NAME="HDR23">Datorer, teknik och samh&auml;lle</A></H3>
Kurskod: <p>

<DL>
<DD>TSIT89<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (obligatorisk)<BR>
</DL>


Detta &auml;r en lite &quot;mjukare&quot; kurs &auml;n vad man &auml;r van att ISY brukar h&aring;lla och syftet med detta &auml;r naturligtvis att man skall f&aring; en lite mer &ouml;vergripande syn p&aring; tekniken och hur den p&aring;verkar samh&auml;llet som vi lever i.<p>
I kursens b&ouml;rjan h&aring;lls ett antal f&ouml;rel&auml;sningar av Viveke F&aring;&aring;k varefter ett antal g&auml;stf&ouml;rel&auml;sare h&aring;ller en f&ouml;rel&auml;sning var om ett &auml;mne som ligger dem varmt om hj&auml;rtat. Dessa g&auml;stf&ouml;rel&auml;sningar &auml;r av skiftande kvalitet, men p&aring; det stora hela gav de m&aring;nga intressanta och t&auml;nkv&auml;rda synpunkter p&aring; f&ouml;reteelser i samh&auml;llet f&ouml;rknippade med ny teknik.<p>
Efter f&ouml;rel&auml;sningsserien f&ouml;ljer ett grupparbete i grupper om sex-sju personer som behandlar ett &auml;mne som gruppen sj&auml;lv v&auml;ljer. Detta arbete utformas i samr&aring;d med en handledare som under kursens g&aring;ng f&ouml;ljer arbetet och f&ouml;rser gruppen med kritik och tips om vad man b&ouml;r och kan behandla i arbetet. Grupparbetet avslutas med en framl&auml;ggning, varvid en annan grupp opponerar p&aring; ens arbete varefter rollerna kastas om och man sj&auml;lv f&aring;r opponera p&aring; ett arbete. Bra uppv&auml;rmning inf&ouml;r kommande exjobbsframl&auml;ggningar och dylikt allts&aring;.<p>
Det sista momentet best&aring;r i att utforma ett enskilt arbete som behandlar ett specifikt omr&aring;de som man tilldelas av handledaren, som sedan bed&ouml;mer hur v&auml;l man har behandlat &auml;mnet samt arbetets spr&aring;kliga utformning.<p>
<H3><A NAME="REF63874">Digital kommunikation</A></H3>
Kurskod: <p>

<DL>
<DD>TSDT76<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Aut, Dag, Tmk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF53372">Telekommunikationsteori (sidan 34)</A><BR>

<LI>Radiokommunikation<BR>
</UL>


Den grundl&auml;ggande problemst&auml;llningen i den h&auml;r kursen &auml;r hur vi ska koda, s&auml;nda och ta emot en digital signal f&ouml;r att &ouml;verf&ouml;ringen ska bli tillr&auml;ckligt s&auml;ker. Vi inf&ouml;r matematiska modeller som hj&auml;lpmedel, till exempel representerar vi olika signaler med hj&auml;lp av vektorer och till dessa adderar vi brus (additivt vitt gaussiskt brus). D&auml;refter utnyttjar vi v&aring;ra kunskaper i matematisk statistik f&ouml;r att ber&auml;kna sannolikheten att signalvektorn fortfarande tolkas som den ursprungliga vektorn n&auml;r den uppf&aring;ngas av mottagaren.<p>
Kurslitteraturen best&aring;r av Simon Haykins bok &quot;Digital Communications&quot;, som har blivit en klassiker inom det h&auml;r omr&aring;det trots att den skrevs s&aring; sent som 1988. Den &auml;r l&auml;ttl&auml;st och inneh&aring;ller m&aring;nga illustrationer. Den negativa sidan &auml;r att den har ett ganska ofullst&auml;ndigt index och att det har smugit sig in en del sm&aring;fel i figurerna. Lektionsundervisningen &auml;r upplagd p&aring; ett lite annorlunda s&auml;tt. Vissa av lektionerna &auml;r l&auml;rarfria, vilket inneb&auml;r att man sj&auml;lv f&aring;r s&ouml;ka upp assistenterna som st&auml;ller upp och besvarar fr&aring;gor. De tre laborationerna &auml;r en viktig del av kursen d&auml;r du f&aring;r verifiera att teorin &ouml;verensst&auml;mmer ganska v&auml;l med verkligheten.<p>
Kursen innefattar dessutom fem frivilliga inl&auml;mningsuppgifter som kan ge upp till tv&aring; po&auml;ng att tillgodor&auml;kna sig p&aring; tentan. G&ouml;r man dessa s&aring; h&auml;nger man med bra under l&auml;sperioden och det &auml;r inga st&ouml;rre sv&aring;righeter att klara tentan. Dessv&auml;rre s&aring; tar de en hel del tid. <p>
<H3><A NAME="REF55877">Analoga kretsar</A></H3>
Kurskod: <p>

<DL>
<DD>TSTE15<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>5  (Dag, Elk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF86271">Kretsteori (sidan 27)</A><BR>
</UL>


Kursen ing&aring;r i elektronikblocket och &auml;r i stort sett obligatorisk f&ouml;r de som g&aring;r elektronikinriktning. Mycket av det du g&aring;r igenom ligger till grund f&ouml;r de kommande kurserna under det fj&auml;rde &aring;ret. Det verkar som om i stort sett all teori bygger p&aring; diodekvationen. Man f&aring;r en grundlig genomg&aring;ng av dioder och deras sammankopplingar. Med olika kopplingar f&aring;r man olika funktioner som fotodioder, transistorer, optoelektroniska komponenter, FET, CMOS, CCD, f&ouml;rst&auml;rkarkopplingar, darlingtonsteg och str&ouml;mspeglar. Den st&ouml;rsta vikten l&auml;ggs dock p&aring; dioden och transistorn som &auml;r en dubbel diod. <p>
&Aring;terkoppling av operationsf&ouml;rst&auml;rkare &auml;r ocks&aring; popul&auml;rt och vanligt f&ouml;rekommande s&aring; det behandlas i stort sett, halva kursen. Genom &aring;terkoppling &aring;stadkoms &auml;ven str&ouml;m- och sp&auml;nningsfel som st&auml;ndigt g&auml;ckar den v&aring;rtr&ouml;tte studenten. Det faktum att kurslitteraturen &auml;r en tung bok p&aring; engelska, g&ouml;r inte saken l&auml;ttare. Tentan brukar anses som relativt sv&aring;r.<p>
<H3><A NAME="REF22408">Bildkodning och datakompression</A></H3>
Kurskod: <p>

<DL>
<DD>TSIT20<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (Dag, Tmk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>
</UL>


Fr&aring;gan &auml;r om inte kursen platsar bland de kurser alla D-are borde l&auml;sa, men tyv&auml;rr s&aring; har nog inte alla tid.<p>
Vad &auml;r det d&aring; som g&ouml;r kursen s&aring; intressant?<p>
Genomg&aring;ende i kursen finns en mycket genomt&auml;nkt koppling mellan avancerad matematisk teori och praktiska till&auml;mpningar. Transformkodning &auml;r en av de kodningsmetoder som diskuteras, till&auml;mpningar p&aring; denna metod finns b&aring;de p&aring; omr&aring;det kodning av stillbilder, JPEG, och r&ouml;rliga bilder, MPEG.<p>
I kursen ing&aring;r tre labbar, den f&ouml;rsta labben best&aring;r av en enklare kodningsuppgift. Den andra labben behandlar &ouml;versiktligt till&auml;mpningen f&ouml;r kodning av stillbilder med cosinustransformkodning. Resultatet j&auml;mf&ouml;rs med en JPEG-kodad bild. Den sista labben behandlar kodning av bildsekvenser med hj&auml;lp av hybridkodning (MPEG), som &auml;r en sammans&auml;ttning av prediktiv- och transformkodning. Implementationen av kodaren g&ouml;rs i programspr&aring;ket C. Denna typ av kodning anv&auml;nds av videotelefoner som kommunicerar &ouml;ver ISDN. Andra intressanta kodningsmetoder som tas upp i kursen &auml;r fraktalkodning, modellbaserad kodning och kodning av f&auml;rgbilder.<p>
Kursmaterialet &auml;r ett kompendium skrivet av Robert Forschheimer som ocks&aring; &auml;r f&ouml;rel&auml;sare i kursen. I kursen ing&aring;r ocks&aring; ett antal lektioner d&auml;r teoriuppgifter p&aring; kursmaterialet behandlas. Lektionerna och f&ouml;rel&auml;sningarna fungerar som bra komplement till kompendiet som i vissa delar tyv&auml;rr &auml;r ganska knapph&auml;ndigt. Ett slutomd&ouml;me om kursen &auml;r att den &auml;r intressant men ganska sv&aring;r.<p>
<H3><A NAME="REF11548">Modellering av industriella system</A></H3>
Kurskod: <p>

<DL>
<DD>TSRT20<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Aut)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>

<LI><A HREF="Kurser.html#REF23036">Reglerteknik Y (sidan 29)</A><BR>

<LI><A HREF="Kurser.html#REF45552">Numeriska algoritmer (sidan 40)</A><BR>
</UL>


Kursen &auml;r en viktig del i &quot;reglerteknikpaketet&quot; eftersom den ger en bakgrund till hur det g&aring;r till att praktiskt ta fram modeller f&ouml;r att simulera och testa regulatorer i industriella system. En stor del i kursen behandlar en metod f&ouml;r att generellt beskriva system med hj&auml;lp av en speciell notation som kallas bindningsgrafer. Detta verktyg som tas upp i kursen kan anv&auml;ndas f&ouml;r att beskriva elektriska system, mekaniska system, fl&ouml;dessystem och termiska system. Under kursen visas ocks&aring; att det finns metoder f&ouml;r att automatiskt &ouml;verf&ouml;ra bindningsgraferna till en matematisk beskrivning som kan anv&auml;ndas vid simulering.<p>
I kursen behandlas ocks&aring; ett annat verktyg, Simulink, som &auml;r ett grafiskt simuleringsverktyg i MatLab. Det diskuteras ocks&aring; metoder f&ouml;r att bygga modeller av system genom att studera systemets uppf&ouml;rande f&ouml;r vissa specifika insignaler.<p>
Som en del av examinationen i kursen ing&aring;r tre labbar. Den f&ouml;rsta av labbarna behandlar simulering med verktyget Simulink. Den andra visar exempel p&aring; hur ett formelmanipulerande spr&aring;k (Maple) kan anv&auml;ndas vid framtagandet av modeller f&ouml;r system. Den sista av de tre labbarna behandlar ett praktiskt exempel p&aring; identifiering av system. Systemet best&aring;r av en v&auml;rmefl&auml;kt med justerbar v&auml;rme. Laborationen g&aring;r ut p&aring; att ta fram modeller av systemet med hj&auml;lp av olika numeriska metoder och diskutera f&ouml;r och nackdelar med de olika modellerna.<p>
Kursliteraturen best&aring;r av kompendier och en bok skriven av Ljung och Glad. Kvaliten p&aring; boken &auml;r h&ouml;g. Lektioner och f&ouml;rel&auml;sningar &auml;r givande och ger en bra bild av kursen tillsammans med labbarna.<p>
<H3><A NAME="REF57375">Digitala filter</A></H3>
Kurskod: <p>

<DL>
<DD>TSTE77<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (valfri)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF86271">Kretsteori (sidan 27)</A><BR>
</UL>


Tyngdpunkten i kursen ligger p&aring; analys och syntes av tidsdiskreta och digitala filter. Kursen inleds med en snabb repetition av LTI-system, sampling och Fouriertransformer f&ouml;r att sedan g&aring; in i detalj p&aring; syntes av IIR-filter, t ex Butterworth, Chebyshev I och II och Cauerfilter samt realisering av dessa med hj&auml;lp av signalprocessorer och datorer. Kursen avslutas med att l&auml;ra ut hur problemen med talrepresentation och begr&auml;nsad ordl&auml;ngd minimeras. P&aring; laborationerna f&aring;r man pr&ouml;va p&aring; att anv&auml;nda datorprogram f&ouml;r att simulera, analysera och syntetisera filter samt implementera ett digitalt filter i Pascal.<p>
Kurslitteraturen best&aring;r av tv&aring; teorib&ouml;cker och en &ouml;vningsbok. D&aring; dessa &auml;r fr&aring;n 70-talet har de kompletterats med s&auml;rtryck ur modernare litteratur. Kursen &auml;r intressant om man vill l&auml;ra sig att konstruera filter f&ouml;r digitala system, och tentan anses normalsv&aring;r.<p>
<H3><A NAME="HDR24">Datorseende </A></H3>
Kurskod: <p>

<DL>
<DD>TSBB02<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Dag)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>
</UL>


Hur tolkar man informationen i en bild? Den h&auml;r kursen inleds med en genomg&aring;ng av hur det m&auml;nskliga synsinnet fungerar (det lilla man vet om det). Sedan f&ouml;ljer en kort repetition av endimensionell och flerdimensionell Fouriertransform. En central del av kursen handlar om hur man anv&auml;nder faltningsk&auml;rnor och Fouriertransform i olika metoder f&ouml;r att uppskatta lokal orientering i en bild (linjer och kanter).<p>
Det h&auml;r &auml;r troligtvis en av de kurser d&auml;r du uppt&auml;cker att dina kunskaper i algebra och analys inte &auml;r tillr&auml;ckliga. N&aring;gra av de viktigaste kapitlen i boken handlar om vad tensorer &auml;r och hur dessa kan anv&auml;ndas f&ouml;r att generalisera teorin. Stoffet i den h&auml;r kursen &auml;r sv&aring;rsm&auml;lt och det &auml;r d&auml;rf&ouml;r viktigt att man deltar aktivt p&aring; laborationer och lektioner.<p>
Laborationerna utf&ouml;rs i MATLAB, AVS (Application Visualisation System) vilket &auml;r ett grafiskt verktyg f&ouml;r bildbehandling, samt p&aring; en speciell bildbehandlingsmaskin, GOP-302 Workstation. Under de fem laborationerna till&auml;mpas p&aring; ett illustrativt s&auml;tt den teori som tagits upp p&aring; f&ouml;rel&auml;sningar och lektioner vilket ger en bra uppfattning om hur teorin fungerar praktiskt.<p>
&Auml;ven om kursen Bildbehandling inte &auml;r n&aring;got f&ouml;rkunskapskrav s&aring; underl&auml;ttar det en hel del om man har sysslat med flerdimensionell Fouriertransform och faltning tidigare. Kursboken (1995), &quot;Signal Processing for Computer Vision&quot;, som &auml;r skriven av bland andra G&ouml;sta Granlund och Hans Knutsson (1995), inneh&aring;ller intressant och modern teori f&ouml;r att analysera information i bilder. Boken &auml;r koncis, mycket abstrakt och tungl&auml;st. Exempelsamlingen inneh&aring;ller m&aring;nga bra &ouml;vningar som tas upp under lektionerna.<p>
Sammanfattningsvis &auml;r det h&auml;r en mycket intressant kurs som leder ett steg n&auml;rmare den forskning som bedrivs inom Bildbehandling vid ISY.<p>
<H3><A NAME="HDR25">Digital signalbehandling</A></H3>
Kurskod: <p>

<DL>
<DD>TSRT77<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (Aut)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>
</UL>


I kursen kommar man n&auml;ra verkligheten d&aring; alla lektioner h&aring;lls i ISYs datorsalar. Det h&auml;r &auml;r en utveckling och till&auml;mpning av krets- och signalteorin. M&aring;nga av uppgifterna &auml;r av karakt&auml;ren att man ska l&ouml;sa ett problem som man st&ouml;ter p&aring; n&auml;r man ska behandla sin signal, t ex att man har f&ouml;r lite data f&ouml;r att egentligen f&aring; ut n&aring;got vettigt, men &auml;nd&aring; kan trixa till dem och f&aring; ett resultat.<p>
Man tar upp andra praktiska saker som vad som h&auml;nder n&auml;r man &quot;nollinbakar&quot; sina signaler och varf&ouml;r det &auml;r bra att ha nollorna i mitten. Mest intressant &auml;r adaptiv filtrering, d&auml;rf&ouml;r &auml;r det avsnittet sist. D&auml;r f&aring;r man till&auml;mpa de kunskaper man har och se ett antal generaliseringar av modellerna som g&ouml;r dem mycket anpassningsbara. Alla datoruppgifter l&ouml;stes i MATLAB.<p>
F&ouml;rel&auml;sningarna h&aring;lls av Mille Millnert som b&ouml;rjar med att g&aring; igenom fouriertransformen grundligt och sedan &ouml;kar tempot ordentligt n&auml;r man kommer till de nya omr&aring;dena som kalman- och adaptiv filtering. M&aring;nga upplevde att det blev v&auml;l mycket fouriertransformer, speciellt om man l&auml;ste Bildbehandling samtidigt och gick fr&aring;n den ena f&ouml;rel&auml;sning till den andra f&ouml;r att f&aring; h&ouml;ra samma sak. Det konstiga &auml;r att man hela tiden l&auml;r sig n&aring;got nytt om den d&auml;r fouriertransformen.<p>
Kursledningen satsade h&aring;rt p&aring; att svara snabbt p&aring; den diskussion som f&ouml;rdes om problem via e-post. De &auml;r v&auml;ldigt intresserade av synpunkter p&aring; kursen och v&auml;ldigt flexibla. Kursmaterialet &auml;r ett kompendium av Mille Millnert, som h&aring;ller normal ISY klass var sig mer eller mindre. Lektionsmaterialet var inte helt klart 1994 men har potential att bli riktigt bra.<p>
Tentamen h&aring;lls &auml;ven den i datorsalar och &auml;r en kombination av teori och praktik. Man f&aring;r ha med sig kurskompendiet som st&ouml;d eftersom uppgifterna f&ouml;rs&ouml;ker efterlikna verkligheten och d&auml;r har man tillg&aring;ng till hj&auml;lpmedel. De flesta tyckte dock att tentan var lagom sv&aring;r. <p>
Kursen &auml;r bra eftersom man f&ouml;r se hur man anv&auml;nder teorierna i praktiken men den tar ganska mycket tid om man ska f&ouml;lja med i lektionsplaneringen.<p>
<H3><A NAME="REF53372">Telekommunikationsteori</A></H3>
Kurskod: <p>

<DL>
<DD>TSIT10<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>8  (Tmk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF70084">Matematisk statistik, grundkurs (sidan 39)</A><BR>

<LI><A HREF="Kurser.html#REF48032">Diskreta strukturer, inledande kurs (sidan 41)</A><BR>
</UL>


M&aring;let med kursen &auml;r att du ska f&aring; en bred kunskap i &auml;mnet, allt ifr&aring;n Shannons informationsteori till teknik f&ouml;r felr&auml;ttande koder och kryptosystem. I kursen anv&auml;nds en undervisningsfilosofi som kallas problembaserad inl&auml;rning(PBI). Den inneb&auml;r att studerande i basgrupper utg&aring;r fr&aring;n en situation och sedan sj&auml;lva styr sin inl&auml;rning f&ouml;r att uppfylla angivna kursm&aring;l. Situationerna &auml;r s&aring; l&aring;ngt det &auml;r m&ouml;jligt s&aring;dana som civilingenj&ouml;ren st&ouml;ter p&aring;. Syftet med detta &auml;r att ge en uppfatting om civilingenj&ouml;rens yrkesroll.<p>
Varje grupp har en handledare vars uppgift &auml;r att underl&auml;tta f&ouml;r, st&ouml;dja och stimulera gruppen. Gruppen har ocks&aring; en datormilj&ouml; till f&ouml;rfogande liksom f&ouml;rel&auml;sare och assistenter som resurspersoner. F&ouml;rel&auml;sningar kommer att ges med m&aring;l att bibringa kunskap och f&ouml;rst&aring;else som inte kan f&aring;s p&aring; annat s&auml;tt. Kursen delas in i fyra teman:<p>

<OL>
<LI>Rymdkommunikation, 2 veckor, 1 situation (t ex rymdsonden &quot;Shannon&quot;).<BR>
Teori och enkel kodning f&ouml;r kanaler st&ouml;rda av vitt, gaussiskt brus.<BR>

<LI>Digital mobilkommunikation, 4 veckor, 2 situationer (t ex mobil fax).<BR>
Felr&auml;ttande koder, kryptering och teori f&ouml;r digitala kanaler.<BR>

<LI>Kommunikation punkt-till-punkt och i n&auml;t, 2 veckor ,1 situation.<BR>
Avancerade koder, teori f&ouml;r kommunikationssystem med flera anv&auml;ndare och kryptering i n&auml;t.<BR>

<LI>Kommunikation via lagringsmedia, 2 veckor, 1 situation.<BR>
Repetition av datakompression, kryptering f&ouml;r datalagring och elektroniska signaturer. <BR>
</OL>


<H3><A NAME="REF19027">Reglerteori</A></H3>
Kurskod: <p>

<DL>
<DD>TSRT35<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>5  (Aut)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF23036">Reglerteknik Y (sidan 29)</A><BR>

<LI><A HREF="Kurser.html#REF70084">Matematisk statistik, grundkurs (sidan 39)</A><BR>
</UL>


Reglerteorin &auml;r en f&ouml;rdjupning av reglertekniken. Den behandlar bl a st&ouml;rningar p&aring; system i form av brus, tidskontinuerliga- och tidsdiskreta system, olinj&auml;ra system och optimal styrning. Inneh&aring;llet i kursen &auml;r mycket tungt och kr&auml;ver en hel del matematik s&aring;som Analys och Linj&auml;r algebra.<p>
Kursen best&aring;r av f&ouml;rel&auml;sningar, lektioner och laborationer. Teorin fr&aring;n f&ouml;rel&auml;sningarna anv&auml;nds i r&auml;kne&ouml;vningar p&aring; lektionerna. Kurslitteraturen &auml;r bra och inneh&aring;ller en nyskriven bok, ett kompendium med r&auml;kne&ouml;vningar, ett kompendium med svar till r&auml;kne&ouml;vningar och laborationsmaterial. Vissa fel fanns dock i f&ouml;rsta upplagan av boken som ska r&auml;ttas till n&auml;sta tryckning. Lektionerna ger mycket och fungerar s&aring; att studenterna r&auml;knar sj&auml;lva och st&auml;ller fr&aring;gor till assistenten n&auml;r de k&ouml;r fast. D&aring; det beh&ouml;vs f&ouml;r att belysa en viss teknik eller n&aring;got sv&aring;rt r&auml;knar assistenten p&aring; tavlan. Tv&aring; lektioner bygger p&aring; anv&auml;ndningen av MATLAB f&ouml;r att se hur resultaten ser ut i &quot;verkligheten&quot;. Laborationerna v&auml;ver samman praktik och teori p&aring; ett bra s&auml;tt. De ger en f&ouml;rst&aring;else f&ouml;r de begrepp som behandlas p&aring; lektioner och f&ouml;rel&auml;sningar. Innan man f&aring;r b&ouml;rja laborera m&aring;ste man dock skriva en dugga p&aring; det avsnitt laborationen behandlar och redovisa de f&ouml;rberedelseuppgifter laborationen inneh&aring;ller. Dessa duggor och f&ouml;rberedelser &auml;r mycket kr&auml;vande.<p>
L&auml;ser man m&aring;nga andra kurser som kr&auml;ver mycket tid eller inte &auml;r s&aring; f&ouml;rtjust i matematik ska man kanske fundera p&aring; om man &ouml;verhuvudtaget ska l&auml;sa Reglerteori. P&aring; tentamen till&aring;ts kursboken som hj&auml;lpmedel vilket g&ouml;r att slutomd&ouml;met p&aring; denna kurs blir; arbetskr&auml;vande men bra. <p>
<H3><A NAME="HDR26">Bildbehandling</A></H3>
Kurskod: <p>

<DL>
<DD>TSEA69<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (Aut, Dag, Tmk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF29650">Signalteori D (sidan 28)</A><BR>
</UL>


Bildbehandling &auml;r precis vad det l&aring;ter som. Man tar in bilder fr&aring;n exempelvis en videokamera och l&aring;ter olika algoritmer bearbeta bilden s&aring; att &ouml;nskat resultat uppn&aring;s, vilket kan vara t ex att filtrera bort brus, uppt&auml;cka defekter p&aring; kretskort eller tolka handskrivna symboler (OCR). <p>
Kursen behandlar m&aring;nga delar inom bildbehandling, b&aring;de grundl&auml;ggande teori, som t ex tv&aring;dimensionell fouriertransform eller icke-euklidiska avst&aring;ndsber&auml;kningar, och praktiska tilll&auml;mpningar som t ex videokameran och datortomografi. Kurslitteraturen best&aring;r av ett kompendium p&aring; svenska av Per-Erik Danielsson samt laborationsmaterial. P&aring; f&ouml;rel&auml;sningarna presenteras metoder och principer p&aring; ett l&auml;ttfattligt och &ouml;versk&aring;dligt s&auml;tt, men det kan k&auml;nnas arbetsamt eftersom det &auml;r en stor m&auml;ngd nya algoritmer. Lektionerna anv&auml;nds till r&auml;kne&ouml;vningar och uppgifterna varierar en hel del i sv&aring;righetsgrad.<p>
De fem laborationerna utf&ouml;rs p&aring; arbetsstationer i ett programpaket som bygger p&aring; programspr&aring;ket FORTH men det kr&auml;vs ingen st&ouml;rre anstr&auml;ngning f&ouml;r att s&auml;tta sig in i den nya milj&ouml;n. Alla n&ouml;dv&auml;ndiga bildbehandlingsoperationer finns redan implementerade. Din uppgift &auml;r att skriva sm&aring; program som utnyttjar dessa f&ouml;r t ex olika typer av bildfiltreringar, segmentering (separera olika objekt i bilden), avst&aring;ndskartor (anv&auml;nds t ex f&ouml;r att finna kortaste v&auml;gen, l&ouml;sningar av labyrinter) eller avst&aring;ndsbed&ouml;mning (hur l&aring;ngt bort fr&aring;n kameran befinner sig olika objekt).<p>
<H3><A NAME="REF58374">Datas&auml;kerhetsmetoder</A></H3>
Kurskod: <p>

<DL>
<DD>TSIT83<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>2  (Tmk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF79911">Datorteknik D (sidan 26)</A><BR>

<LI><A HREF="Kurser.html#REF71272">Processprogrammering (sidan 6)</A><BR>
</UL>


Kursen avser att ge k&auml;nnedom om de s&auml;kerhetsproblem som kan uppst&aring; i ADB-system och de skyddsmetoder som kan anv&auml;ndas. Det &auml;r den enda kursen p&aring; D-linjen som behandlar omr&aring;det datas&auml;kerhet helt&auml;ckande, fr&aring;n s&auml;kerhetsanalys till s&auml;kerhetsplan och med laborationer d&auml;r praktiska problem som kryptokn&auml;ckning och implementering av beh&ouml;righetskontroller i ett operativsystem behandlas.<p>
Teoriundervisningen omfattar f&ouml;rel&auml;sningar och storseminarier. F&ouml;rel&auml;sare Viveke F&aring;&aring;k &auml;r mycket engagerad och kunnig. Storseminarierna &auml;r ett diskussionsforum d&auml;r olika fr&aring;gest&auml;llningar tas upp i mindre grupper. Kompendiet som anv&auml;nds &auml;r mycket bra och t&auml;cker kursen v&auml;l. Praktisk till&auml;mpning sker vid fyra laborationspass d&auml;r den sista laborationen &auml;r n&aring;got st&ouml;rre. Examinationen sker inte med en tentamen utan med en inl&auml;mningsuppgift som utf&ouml;rs enskilt eller med en kamrat. Uppgiften, som man v&auml;ljer sj&auml;lv, &auml;r av typen &quot;G&ouml;r en analys av ett f&ouml;retags s&auml;kerhetsrutiner och f&ouml;resl&aring; en s&auml;kerhetsplan&quot; och resulterar i en mindre rapport.<p>
Datas&auml;kerhetsmetoder &auml;r en intressant kurs som rekommenderas. Den &auml;r konkret samtidigt som den &auml;r allm&auml;nbildande inom ett omr&aring;de d&auml;r det &auml;r viktigt med kompetent och v&auml;lutbildad personal.<p>
<H2><A NAME="HDR27">Matematiska Institutionen</A></H2>
<H3><A NAME="REF42963">Linj&auml;r algebra</A></H3>
Kurskod: <p>

<DL>
<DD>TATM18<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>5  (obligatorisk)<BR>
</DL>


Algebran &auml;r en kurs som f&ouml;r m&aring;nga k&auml;nns v&auml;ldigt tung i b&ouml;rjan. Stoffet &auml;r till skillnad fr&aring;n Analysen helt nytt f&ouml;r de flesta och att bara s&auml;tta sig in i terminologin k&auml;nns tungt i b&ouml;rjan. Kurslitteraturen, b&ouml;ckerna &quot;Krypa - G&aring;&quot; och &quot;Boken med kossan p&aring;&quot; skrivna av Peter Hackman, &auml;r dessutom v&auml;ldigt kompakt skrivna. Men med lite m&ouml;da faller bitarna p&aring; plats och efter ett tag l&auml;r man sig uppskatta Kossans koncisa no-nonsense framst&auml;llning av materialet.<p>
I linj&auml;r algebra knyter man ihop matrisr&auml;kning med l&ouml;sning av ekvationssystem och geometri i valfritt antal dimensioner. Tillsammans skapar dessa ett kraftfullt verktyg med till&auml;mpningar inom t ex datorgrafik, robotteknik och reglerteknik.<p>
Till omedelbar nytta kommer ocks&aring; kunskaperna i Analys B, Krets- och m&auml;tteknik och Numeriska algoritmer. Nytt fr&aring;n f&ouml;rra &aring;ret &auml;r att en kontrollskrivning ges efter period ett. Tar man den har man 4 gratispo&auml;ng att tillgodor&auml;kna sig p&aring; tentamen, s&aring; den f&ouml;rutseende studenten inser genast f&ouml;rdelarna med att h&auml;nga med i kursen fr&aring;n b&ouml;rjan. I &ouml;vrigt &auml;r kanske den viktigaste beh&aring;llningen fr&aring;n kursen en fin s&aring;ng och tipset &quot;byt bas och se b&auml;ttre.&quot; <p>
<H3><A NAME="REF75854">Analys D</A></H3>
Kurskod: <p>

<DL>
<DD>TATM03<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>18  (obligatorisk)<BR>
</DL>


Analys del A ing&aring;r i tematermin 1 och &auml;r p&aring; 11 po&auml;ng, vilket g&ouml;r den till den st&ouml;rsta kursen under hela utbildningen. Den &auml;r en forts&auml;ttning och f&ouml;rdjupning p&aring; gymnasiematematiken och proppen, men mycket mer ing&aring;ende. Man m&aring;ste exempelvis beh&auml;rska h&auml;rledningar och bevis av satser betydligt b&auml;ttre &auml;n p&aring; gymnasiet.<p>
I b&ouml;rjan tas komplexa tal och diverse funktionsteori upp, s&aring; som olikheter, binomialfunktioner och polynomdivision. Sedan f&ouml;ljer det huvudsakliga momentet i analyskursen, n&auml;mligen gr&auml;nsv&auml;rden, differentialkalkyl (derivator) och integralkalkyl. Detta blandas med ett lite frist&aring;ende avsnitt s&aring;som Taylorutveckling, som f&ouml;renklar funktionsunders&ouml;kningar omkring ett visst v&auml;rde. Kursen avslutas med differentialekvationer och ett avsnitt som tidigare l&aring;g i Analys del B, serier och generaliserade integraler.<p>
Litteraturen som anv&auml;nds &auml;r &quot;Analys i en variabel&quot; (Arne P:s r&ouml;da), som allm&auml;nt uppfattas som bra och relativt l&auml;ttl&auml;st med bra utf&ouml;rliga exempel. Boken kompletteras med &quot;Kompletterande kompendium i Analys&quot; fr&aring;n MAI. Man tenterar kursen genom att f&ouml;rsta tentaperioden ha en kontrollskrivning p&aring; det man dittills l&auml;st (ungef&auml;r fram till Taylorutveckling). Om man premieras med godk&auml;nt p&aring; den s&aring; f&aring;r man tillgodor&auml;kna sig tre po&auml;ng p&aring; f&ouml;rsta uppgiften p&aring; den riktiga tentan i julperioden, vilket ofta kan vara en stor hj&auml;lp till att klara tentan.<p>
Analys del B &auml;r, inte helt ov&auml;ntat, en forts&auml;ttning p&aring; del A. Kursen ger 7 po&auml;ng och ing&aring;r i tematermin tre. Liksom p&aring; A-delen ges en kontrollskrivning efter f&ouml;rsta perioden.<p>
Efter att ha deriverat och integrerat funktioner av en variabel i Analys del A, s&aring; ska man nu ge sig p&aring; funktioner med flera variabler. H&auml;r anv&auml;nds m&aring;nga begrepp och satser som introducerades i del A, och ibland kan man ocks&aring; sk&ouml;nja vissa samband mellan Analys och Linj&auml;r algebra. Detta &auml;r avslutningen p&aring; det stora arbetskr&auml;vande matteblocket i l&auml;gre &aring;rskurs, och tillsammans med <A HREF="Kurser.html#REF42963">Linj&auml;r algebra (sidan 37)</A> och <A HREF="Kurser.html#REF46914">Diskret matematik och logik (sidan 39)</A> ger Analyskursen en god grund inf&ouml;r de h&ouml;gre &aring;rskurserna.<p>
Litteraturen i del B &auml;r &quot;Analys i flera variabler&quot; (Arne P:s gr&ouml;na) kompletterat med &quot;Seriemagasinet&quot; fr&aring;n MAI. Tentamen &auml;r upplagd p&aring; samma s&auml;tt som i del A.<p>
Analyskursen &auml;r ingen l&auml;tt kurs om man kommer efter redan fr&aring;n b&ouml;rjan, s&aring; f&ouml;rs&ouml;k att r&auml;kna alla hemuppgifter och f&ouml;rbereda er inf&ouml;r f&ouml;rel&auml;sningarna, det tj&auml;nar man p&aring; i slut&auml;ndan. F&ouml;rel&auml;saren och tillika examinatorn &auml;r Keijo Hild&eacute;n, som har en tendens att skriva fortare ju l&auml;ngre f&ouml;rel&auml;sningarna h&aring;ller p&aring;, s&aring; det g&auml;ller att h&auml;nga med och vara koncentrerad hela tiden. Om ni lyckas med detta s&aring; kommer kursen inte att k&auml;nnas s&aring; tung, och tentamen kommer att g&aring; bra. Gl&ouml;m inte att goda kunskaper i Analys &auml;r en f&ouml;ruts&auml;ttning f&ouml;r m&aring;nga andra kurser, s&aring; som Mekanik, Elektromagnetism och Kretsteori! Det &auml;r v&auml;l ytterligare en anledning till att l&auml;ra sig Analys och inte bara se den som en tung, o&ouml;verstiglig kurs som bara &auml;r inlagd f&ouml;r att j&auml;vlas med studenterna.<p>
<H3><A NAME="REF64291">Grundl&auml;ggande diskret matematik</A></H3>
Kurskod: <p>

<DL>
<DD>TATM43<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4,5  (obligatorisk, utg&aring;ende)<BR>
</DL>


Diskret matematik &auml;r en kurs som f&ouml;r den oinvigde kan verka en smula f&ouml;rbryllande. En tr&ouml;st kan vara att kursen inte p&aring; n&aring;got s&auml;tt &auml;r diskret i vardaglig mening. Diskreta kallas de hela talen, som kursen handlar mycket om.<p>
Vad kursen inneh&aring;ller &auml;r mycket sv&aring;rt att beskriva, d&aring; mycket av stoffet &auml;r av abstrakt karakt&auml;r. Meningen &auml;r att man ska fylla den lucka som finns mellan matematik och datalogi. Och visst har man nytta av kursen, &auml;ven om det i b&ouml;rjan verkar tveksamt. F&ouml;rst l&auml;r man sig att handskas med m&auml;ngder och relationer p&aring; dessa. Inte helt utan problem knyter man sedan ihop relationer med partiella ordningar och latissar. Latissar leder till teorin f&ouml;r booleska algebra som i n&aring;gon mening &auml;r m&aring;let med kursen. Boolesk algebra k&auml;nner m&aring;nga till fr&aring;n gymnasiet, men ges i denna kurs en lite djupare inneb&ouml;rd. Man f&aring;r ocks&aring; l&auml;sa om de hela talen och kombinatorik, detta &auml;r inte fullt s&aring; abstrakt som andra delar i kursen.<p>
Avslutningsvis f&aring;r man lite nyttiga kunskaper om tr&auml;d och grafer, vilka &auml;r anv&auml;ndbara i programmering. Kursen upplevs av m&aring;nga som sv&aring;r och abstrakt i b&ouml;rjan, men mot slutet av kursen f&aring;r de flesta en aha-upplevelse.<p>
<H3><A NAME="REF46914">Diskret matematik och logik</A></H3>
Kurskod: <p>

<DL>
<DD>TATM90<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>8  (obligatorisk)<BR>
</DL>


Kursen &auml;r en sammanslagning av <A HREF="Kurser.html#REF64291">Grundl&auml;ggande diskret matematik (sidan 38)</A> och <A HREF="Kurser.html#REF11029">Logik, grundkurs (sidan 4)</A>.<p>
<H3><A NAME="REF70084">Matematisk statistik, grundkurs</A></H3>
Kurskod: <p>

<DL>
<DD>TAMS16<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF75854">Analys D (sidan 37)</A><BR>

<LI><A HREF="Kurser.html#REF42963">Linj&auml;r algebra (sidan 37)</A><BR>
</UL>


Matematisk Statistik, del 1<p>
Denna kurs upplevs i allm&auml;nhet som l&auml;tt och det finns inte mycket att klaga p&aring;, varken p&aring; l&auml;romedel eller f&ouml;rel&auml;sningar. F&ouml;rel&auml;sningarna, som leds av Torbj&ouml;rn Linhardt, g&aring;r inte f&ouml;r fort fram, detta m&auml;rks speciellt p&aring; de f&ouml;rsta f&ouml;rel&auml;sningarna, en del av det grundl&auml;ggande stoffet &auml;r repetition fr&aring;n diskreta matematiken och gymnasiet. I kursen f&aring;r man anv&auml;ndning f&ouml;r sina kunskaper i analys, fr&auml;mst (generaliserade) integraler och serier, men dessa &auml;r ganska standardbetonade och man l&auml;r sig dem snart. Det kan ocks&aring; vara till viss nytta att ha m&auml;ngdl&auml;ran och kombinatoriken fr&aring;n diskreta matematiken i bakhuvudet.<p>
Kursen har ett ganska litet antal lektioner, kanske rent av f&ouml;r f&aring;, men de som finns ger en hel del i utbyte. I samband med lektionerna finns ett antal hemuppgifter, som hj&auml;lper dig att h&aring;lla j&auml;mna steg med tidsplanen (precis som i alla andra kurser &auml;r det l&auml;tt att hamna p&aring; efterk&auml;lken). Exempelsamlingen inneh&aring;ller m&aring;nga uppgifter att &ouml;va p&aring;, dock &auml;r facit n&aring;got knapph&auml;ndigt, oftast bara ett svar.<p>
Matematisk Statistik, del 2<p>
I denna del av kursen behandlas sj&auml;lva statistiken, som t ex punktskattning, intervallskattning, hypotespr&ouml;vning och konfidensintervall. Dessutom inneh&aring;ller kursen en del k&ouml;teori, som till&auml;mpas i bl a datorsystem.<p>
F&ouml;rel&auml;sningarna tar upp den teori som beh&ouml;vs f&ouml;ra att l&ouml;sa uppgifterna i kompendiet. L&auml;roboken som anv&auml;nds &auml;r samma som anv&auml;ndes i del 1. D&auml;rut&ouml;ver tillkommer ett kompendium i k&ouml;teori som &auml;r sammanst&auml;llt av examinatorn. Kursen kan ibland upplevas som tr&aring;kig, men &auml;r inte speciellt sv&aring;r om man g&aring;r p&aring; lektioner och r&auml;knar de rekommenderade uppgifterna. P&aring; lektionerna &auml;gnas st&ouml;rre delen av tiden &aring;t sj&auml;lvr&auml;kning.<p>
<H3><A NAME="REF45552">Numeriska algoritmer</A></H3>
Kurskod: <p>

<DL>
<DD>TANA43<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF75854">Analys D (sidan 37)</A><BR>

<LI><A HREF="Kurser.html#REF42963">Linj&auml;r algebra (sidan 37)</A><BR>

<LI>Grundkunskaper i programmering.<BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Numeriska metoder II<BR>

<LI><A HREF="Kurser.html#REF11848">Fortran (sidan 41)</A><BR>

<LI>m fl<BR>
</UL>


Kursen kan ses som en utvidgning av analysen eftersom den bland annat behandlar integraler, derivator och differentialekvationer. H&auml;r l&auml;r vi oss hur man numeriskt l&ouml;ser s&aring;dana problem, fr&auml;mst p&aring; datorer. Vi l&auml;r oss r&auml;kna ut hur flyttalsrepresentation ger avrundningsfel, som sedan beroende p&aring; ber&auml;kningsmetoder ger upphov till olika fel i resultatet. Dessutom ing&aring;r bland annat hur grundl&auml;ggande funktioner som sinus och rotfunktionen implementeras i datorer samt hur kurvor och linjer anpassas till en m&auml;ngd av funktionsv&auml;rden.<p>
Det &auml;r en ganska typisk MAI-kurs eftersom den till stor del g&aring;r ut p&aring; att l&auml;ra sig en massa standardmetoder. Ganska m&aring;nga timmar i veckan &auml;r schemalagda vilket g&ouml;r att man f&aring;r jobba en del f&ouml;r att inte komma efter. F&ouml;rel&auml;sningarna f&ouml;ljer boken ganska v&auml;l, s&aring; det &auml;r m&ouml;jligt att l&auml;sa in det som behandlas p&aring; f&ouml;rel&auml;sningarna sj&auml;lv. Boken &auml;r bitvis v&auml;l teoretisk och t&auml;cker ocks&aring; in en hel del som inte ing&aring;r i kursen. Lektionerna b&ouml;r man helst inte missa. D&auml;r ges ocks&aring; en del f&ouml;rberedande och nyttiga genomg&aring;ngar inf&ouml;r laborationerna. Speciellt de senare labbarna kan vara sv&aring;ra annars.<p>
N&aring;gra centrala begrepp som &aring;terkommer p&aring; flera st&auml;llen &auml;r maximalfeluppskattning, felfortplantning och Richardsonextrapolation. L&auml;r er dem! Inf&ouml;r kursen &auml;r det l&auml;mpligt att &quot;f&auml;rska upp&quot; algebrans matrisr&auml;kningar och minsta kvadratanpassning samt analysens serier och derivator. Det &auml;r ganska mycket att l&auml;ra sig i kursen men inte s&aring; sv&aring;ra saker f&ouml;r att vara en MAI-kurs.<p>
<H3><A NAME="HDR28">Kombinatorisk optimering, grundkurs </A></H3>
Kurskod: <p>

<DL>
<DD>TAOP13<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3,5  (obligatorisk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF42963">Linj&auml;r algebra (sidan 37)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Kombinatorisk optimering, forts&auml;ttningskurs<BR>

<LI>m fl<BR>
</UL>


Detta &auml;r den sista obligatoriska matematikkursen, det &auml;r ocks&aring; en ganska s&aring; teoretisk kurs. Man l&auml;r sig formulera och l&ouml;sa olika min/max-problem med hj&auml;lp av olika modeller och problemformuleringar samt att bed&ouml;ma problemens komplexitet och sv&aring;righetsgrad. Ett problem man f&aring;r l&auml;ra sig att l&ouml;sa &auml;r hur man ska koppla ihop datorer i ett n&auml;tverk s&aring; billigt som m&ouml;jligt men &auml;nd&aring; uppfyller tillf&ouml;rlitlighetskrav och kapacitetskrav. En annan sak man f&aring;r l&auml;ra sig &auml;r hur man skyller ifr&aring;n sig p&aring; ett vetenskapligt korrekt s&auml;tt, det vill s&auml;ga hur man bevisar att man inte &auml;r dum n&auml;r man inte kan l&ouml;sa ett visst problem. Man bevisar d&aring; att problemet &auml;r ol&ouml;sbart med diverse knep.<p>
I kursen ing&aring;r ocks&aring; tv&aring; stycken frivilliga laborationer, de &auml;r bra att g&ouml;ra f&ouml;r att de ger 6 po&auml;ng av 80 p&aring; tentan plus att de &auml;r ganska l&auml;tta.<p>
Kurslitteraturen &auml;r en bok som f&ouml;rel&auml;saren har skrivit s&aring; den f&ouml;ljer och t&auml;cker kursen v&auml;l. P&aring; lektionerna g&aring;r assistenten igenom mycket p&aring; tavlan s&aring; det blir inte s&aring; mycket tid att r&auml;kna sj&auml;lv. Det finns en forts&auml;ttningskurs att g&aring; f&ouml;r den som vill. <p>
<H3><A NAME="REF48032">Diskreta strukturer, inledande kurs</A></H3>
Kurskod: <p>

<DL>
<DD>TATM47<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>1  (Tmk)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF75854">Analys D (sidan 37)</A><BR>

<LI><A HREF="Kurser.html#REF42963">Linj&auml;r algebra (sidan 37)</A><BR>

<LI><A HREF="Kurser.html#REF46914">Diskret matematik och logik (sidan 39)</A><BR>
</UL>


Kursen &auml;r en forts&auml;ttning p&aring; Diskret matematik och best&aring;r av lektioner som mest kan liknas vid traditionella f&ouml;rel&auml;sningar. Det som upplevdes som negativt var att f&ouml;rel&auml;saren ibland mer eller mindre &quot;tappade kontakten&quot; med studenterna.<p>
Kurslitteraturen best&aring;r av stenciler och egna anteckningar ifr&aring;n lektionerna. Dessa t&auml;cker dock inte hela kursen. Man l&auml;ser bl a om grupper, ringar, kroppar och lite om kodningsteori. Den alternativa examinationen (hemuppgifter eller tentamen) var bra och borde tilll&auml;mpas i fler kurser. Hemuppgifterna fungerade bra utom i ett par fall d&aring; de var v&auml;ldigt sv&aring;ra. Den grundliga genomg&aring;ngen av l&ouml;sningar till uppgifterna var positiv. Denna kurs &auml;r grunden f&ouml;r hela Tmk-profilen och rekommenderas d&auml;rf&ouml;r starkt f&ouml;r de som t&auml;nker v&auml;lja att inrikta sig p&aring; telematik. <p>
<H3><A NAME="REF11848">Fortran</A></H3>
Kurskod: <p>

<DL>
<DD>TANA70<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>1  (valfri)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF45552">Numeriska algoritmer (sidan 40)</A><BR>
</UL>


P&aring;byggnadskurser: <p>

<UL>
<LI>Tekniska ber&auml;kningar med superdator<BR>
</UL>


Under avdelningen f&ouml;r bisarra och konstifika programspr&aring;k placerar man g&auml;rna in Fortran. Fortran st&aring;r f&ouml;r FORmula TRANsformation och &auml;r ett matematiskt spr&aring;k. F&ouml;rr i tiden byggdes alla stora operativsystem p&aring; Fortran. Som exempel kan anges VMS (Digital) och Sintran (Norsk Data). Nuf&ouml;rtiden skriver man hellre operativsystem i C, Fortran anv&auml;nds till stora matematiska ber&auml;kningar i superdatorer. SMHI i Norrk&ouml;ping anv&auml;nder Fortran till att ber&auml;kna v&auml;der. Saab och Volvo anv&auml;nder spr&aring;ket i bl a stora vindtunneltest. N&aring;gon form av strukturerat t&auml;nkande beh&ouml;vs verkligen d&aring; Fortran annars l&auml;tt ter sig som en gryta kokad spaghetti. Fortran &auml;r ett kompilerande spr&aring;k vilket inneb&auml;r att man f&ouml;rst skriver programkoden, sen h&auml;ller man den genom en kompilator och vips har man ett fungerande program... tror man. F&auml;llorna &auml;r m&aring;nga och reglerna likas&aring;. N&auml;r dessa v&auml;l &auml;r instuderade &auml;r det ingen konst att skriva fungerande program.<p>
Fortran f&aring;r v&auml;l klassas till ett mellanniv&aring;spr&aring;k eftersom det &auml;r tillverkat f&ouml;r att ha god kontakt med de mer maskinn&auml;ra delarna av en dator. Det faktum att man kan dela upp variabler p&aring; de mest konstifika s&auml;tt g&ouml;r inte saken b&auml;ttre. Kursen i &ouml;vrigt &auml;r bara ett f&ouml;rebyggande led till kursen Tekniska ber&auml;kningar med superdator. Denna superdator programmeras ofta i Fortran och sista labben i kursen ger, om man vill, en liten inblick &aring;t det h&aring;llet. Kurslitteraturen best&aring;r av en svensk bok om programmering i Fortran samt ett kompendium som utges av matematiska institutionen. Fortran &auml;r en l&auml;tt och trevlig kurs f&ouml;r den som beh&ouml;ver en extra studiepo&auml;ng fort.<p>
<H2><A NAME="HDR29">Fakulteten f&ouml;r Humaniora och Samh&auml;llsvetenskap</A></H2>
<H3><A NAME="HDR30">Teknikens utveckling i ett samh&auml;llsperspektiv</A></H3>
Kurskod: <p>

<DL>
<DD>TGTU65<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>3  (valfri)<BR>
</DL>


Det h&auml;r &auml;r inte en kurs f&ouml;r dig som s&ouml;ker &quot;aha-upplevelser&quot; i den meningen att du gillar att sitta p&aring; f&ouml;rel&auml;sningar och k&auml;nna att du verkligen l&auml;r dig n&aring;got, utan den v&auml;nder sig nog fr&auml;mst till dig som &auml;r lite mer filosofiskt lagd. Kursen ges av Tema Teknik och social f&ouml;r&auml;ndring och den best&aring;r av cirka tolv f&ouml;rel&auml;sningar i olika &auml;mnen. F&ouml;rel&auml;sningarna som varierar lite &aring;r fr&aring;n &aring;r, kan t ex handla om hur ny teknik v&auml;rderas, hur den sprids och vilka effekter den f&aring;r p&aring; samh&auml;llet. Hur staten kan p&aring;verka den tekniska forskningen och utvecklingen samt kvinnornas roll i den tekniska utvecklingen &auml;r andra exempel p&aring; &auml;mnen som tas upp p&aring; f&ouml;rel&auml;sningarna. Kvaliteten p&aring; f&ouml;rel&auml;sarna &auml;r ganska oj&auml;mn, vissa &auml;r bra och andra mindre bra. Kurslitteraturen delas ut p&aring; f&ouml;rel&auml;sningarna och best&aring;r av utdrag ur diverse b&ouml;cker och andra skrifter. F&ouml;r att bli godk&auml;nd p&aring; kursen som &auml;r p&aring; tre po&auml;ng, ska du skriva tv&aring; uppsatser samt vara n&auml;rvarande vid 75 % av f&ouml;rel&auml;sningarna. Den ena av uppsatserna ska dessutom seminariebehandlas (opponeras p&aring;) och du ska sj&auml;lv opponera p&aring; en uppsats. Sammanfattningsvis kan s&auml;gas att kursen har potential att vara mycket intressant, men v&auml;ldigt mycket h&auml;nger p&aring; f&ouml;rel&auml;sarna och deras &auml;mnen. <p>
<H3><A NAME="HDR31">Perspektiv p&aring; Europa: Historiens huvudlinjer </A></H3>
Kurskod: <p>

<DL>
<DD>TGTU03<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (valfri)<BR>
</DL>


Detta &auml;r en kurs som ing&aring;r i humaniorablocket och ges av den samh&auml;llsvetenskapliga institutionen. Kursen &auml;r uppdelad i ett flertal moment som ska ge en bred &ouml;verblick &ouml;ver Europas historia och filosofi. Kursen inleds med en kronologisk &ouml;versikt av den historiska utvecklingen fr&aring;n de gamla grekerna till Napoleon. D&auml;refter ges n&aring;gra f&ouml;rel&auml;sningar i speciella omr&aring;den som j&auml;rnhanteringen i Sverige nationalismen och urbaniseringen. Parallellt med detta ges ocks&aring; n&aring;gra f&ouml;rel&auml;sningar i idehistoria och filosofi under samma tidsperiod.<p>
Kurslitteraturen best&aring;r av b&ouml;ckerna &quot;Tidernas Europa&quot; och &quot;Idehistoriens huvudlinjer&quot;. Dessutom f&aring;r man ett tjockt stencilh&auml;fte som inneh&aring;ller utdrag av artiklar och b&ouml;cker som anknyter till f&ouml;rel&auml;sningarna i speciella omr&aring;den. Allm&auml;nt sett &auml;r det mycket att l&auml;sa igenom, och kursen &auml;r p&aring; detta s&auml;tt r&auml;tt kr&auml;vande.<p>
F&ouml;rel&auml;sningarna tar upp k&auml;rnpunkterna i materialet och f&ouml;rs&ouml;ker belysa dessa ur olika synvinklar. F&ouml;rel&auml;sningarna i de speciella omr&aring;dena h&aring;lls av olika f&ouml;rel&auml;sare som har en god anknytning till &auml;mnet. &Ouml;verblicken kan bli lite ytlig ibland men med tanke p&aring; den begr&auml;nsade tiden som f&ouml;rel&auml;sara har till sitt f&ouml;rfogande g&ouml;r de ett bra jobb. Kursen &auml;r bra och b&ouml;r ge n&aring;got nytt f&ouml;r alla som l&auml;ser den.<p>
<H3><A NAME="REF70278">Praktisk svenska</A></H3>
Kurskod: <p>

<DL>
<DD>TGTU73<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>1  (obligatorisk)<BR>
</DL>


P&aring;byggnadskurser: <p>

<UL>
<LI><A HREF="Kurser.html#REF77340">Spr&aring;klig kommunikation (sidan 43)</A><BR>
</UL>


Denna kurs ges parallellt med en projektkurs i &aring;rskurs tv&aring;. Man f&aring;r l&auml;ra sig hur man presenterar material, b&aring;de muntligt och skriftligt, med inriktning p&aring; teknisk text. Det ges ocks&aring; en kortfattad genomg&aring;ng av muntlig framst&auml;llning och denna del av kursen examineras genom ett kort f&ouml;redrag. De andra som g&aring;r kursen ska sedan opponera p&aring; det f&ouml;redrag som du h&aring;ller. Det &auml;r nyttigt att tr&auml;na p&aring; att opponera p&aring; andra. I den skriftliga delen behandlas n&aring;gra av de anv&auml;ndarhandledningar som skrivits i projektkursen och &auml;ven i h&auml;r ska man opponera. Som f&auml;rdig civilingenj&ouml;r har man nytta av denna kurs d&aring; man ska skriva dokument och prata inf&ouml;r folk. Examinationen best&aring;r i n&auml;rvaroplikt och ett muntligt framtr&auml;dande.<p>
<H3><A NAME="REF77340">Spr&aring;klig kommunikation</A></H3>
Kurskod: <p>

<DL>
<DD>TGTU02<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (valfri)<BR>
</DL>


F&ouml;rkunskaper: <p>

<UL>
<LI><A HREF="Kurser.html#REF70278">Praktisk svenska (sidan 43)</A><BR>
</UL>


En v&auml;ldigt rolig och nyttig kurs. Ingen tentamen och n&auml;stan ingen kurslitteratur, men visst f&aring;r man arbeta f&ouml;r de fyra po&auml;ng som ges. Mycket bra f&ouml;rel&auml;sningar med olika f&ouml;rel&auml;sare och &ouml;vningar i sm&aring; lektionsgrupper bygger upp kursen som &auml;r uppdelad i en skriftlig och en muntlig del.<p>
Den skriftliga delen kan i sin tur delas upp i tv&aring; delar, n&auml;mligen inneh&aring;ll (hur det man skrivit tidigare borde ha formulerats) och layout (hur det man skrivit tidigare borde ha sett ut). Detta tr&auml;nas genom olika skriftliga &ouml;vningar, d&auml;r man f&ouml;rv&auml;ntas prestera en informativ skrift (PM), en argumenterande text och ett lite st&ouml;rre grupparbete. Allt redovisas inf&ouml;r gruppen som bidrar med konstruktiv kritik.<p>
Den muntliga delen ger f&auml;rdigheter i att f&ouml;rbereda och h&aring;lla tal. Presentation och argumentation &auml;r tv&aring; typtal som kursdeltagarna tr&auml;nar p&aring; att h&aring;lla. Publiken, d v s de andra i lektionsgruppen tittar p&aring; inneh&aring;ll och framf&ouml;rande vilket resulterar i en del konstruktiv kritik. Avslutningsvis kan s&auml;gas att f&auml;rdigheterna i tal och skrift &ouml;kar markant under kursens g&aring;ng. Nervositeten f&ouml;r att tala inf&ouml;r en grupp minskar och s&auml;kerheten att hantera talorgan och ordbehandlare blir st&ouml;rre. L&auml;s spr&aring;klig kommunikation!<p>
<H3><A NAME="HDR32">Informationss&ouml;kning och biblioteksanv&auml;ndning</A></H3>
Kurskod: <p>

<DL>
<DD>TGTU60<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>1  (frivillig)<BR>
</DL>


Du tror s&auml;kert att du kan hitta b&ouml;cker p&aring; ett bibliotek och inte beh&ouml;ver g&aring; den h&auml;r kursen. Fel! Kursen handlar om mycket mer. Den g&aring;r igenom m&aring;nga m&ouml;jligheter att hitta b&ouml;cker och tidskriftsartiklar som i alla fall jag inte hade en aning om. Man l&auml;r sig s&ouml;ka effektivt med hj&auml;lp av de system som finns p&aring; bibliotekets datorer, sl&aring; i indexverk, hitta i svensk standard med mera. <p>
En lektion handlar om patent; viktig kunskap f&ouml;r den som funderar p&aring; att uppfinna n&aring;got. Bibliotekets WWW-sidor presenteras ocks&aring;. Jag kan rekommendera den h&auml;r kursen till alla som tycker om att leta upp egna k&auml;llor till projektarbeten, hobbies etc. eller vill f&ouml;rdjupa sig utanf&ouml;r ordinarie kursplan i n&aring;got &auml;mne. Dessutom &auml;r den nyttig och allm&auml;nbildande.<p>
<H3><A NAME="HDR33">Ledarskap</A></H3>
Kurskod: <p>

<DL>
<DD>TGTU04<BR>
</DL>


Po&auml;ng: <p>

<DL>
<DD>4  (Pvp)<BR>
</DL>


Det h&auml;r &auml;r inte en kurs som talar om hur man blir en bra ledare. Kursen syftar snarare till att ge kunskaperna hur man analyserar en situation p&aring; ett systematiskt s&auml;tt utifr&aring;n den omfattande forskning som har gjorts och dessutom f&ouml;rst&aring; ledningsprocesser inom grupper och organisationer.<p>
Undervisningen &auml;r f&ouml;rdelad p&aring; en kombination av f&ouml;rel&auml;sningar och seminarier som &auml;r f&ouml;rlagda till fyratimmarspass och vanliga f&ouml;rel&auml;sningar. F&ouml;rel&auml;snignsseminareierna, som har obligatorisk n&auml;rvaro, h&aring;lls bl a av n&aring;gra f&ouml;rel&auml;sare fr&aring;n EKI som var mycket duktiga. Under dessa tillf&auml;llen h&aring;lls &auml;ven olika organisationsspel d&auml;r man i grupper f&aring;r ett scenario som man arbetar med och sedan j&auml;mf&ouml;r med hur n&aring;got f&ouml;retag har handlat i den situationen. Andra scenarion &auml;r n&auml;r man g&ouml;r tester p&aring; sig sj&auml;lv f&ouml;r att f&aring; reda p&aring; hur man hanterar situationer.<p>
Av f&ouml;rel&auml;sningarna &auml;r speciellt de om vad makt &auml;r och hur makt uppkommer fascinerande. Under senare delen h&aring;lls &auml;ven ett antal g&auml;stf&ouml;rel&auml;sningar av skiftande kvalitet. I kursen ing&aring;r &auml;ven en projektuppgift som g&ouml;rs tv&aring; och tv&aring; . Exempel p&aring; uppgifter &auml;r &quot;Kundkontakter sett ur ett ledningsperspektiv&quot;, &quot;Hur agerar ledaren i en beslutande grupp&quot; och &quot;Ledarens v&auml;rderingar&quot;. Syftet med uppgiften &auml;r att till&auml;mpa n&aring;gon teori och f&aring; fram n&aring;got nytt, vilket &auml;r arbetskr&auml;vande men mycket givande. Kurslitteraturen &auml;r bra, speciellt boken av Yukl. I kursinformationen rekommenderades &auml;ven en bok av Metzger men m&aring;nga klarade sig utm&auml;rkt utan den. B&aring;da b&ouml;ckerna &auml;r p&aring; engelska.<p>
Kursens organisation kan enkelt beskrivas som st&ouml;kig. F&ouml;rst var det alla obligatoriska delarna som passade p&aring; att krocka med de andra kurserna man l&auml;ste. N&auml;r de obligatoriska f&ouml;rel&auml;sningsseminarierna tog slut b&ouml;rjade projekten d&auml;r m&aring;nga hade sv&aring;righeter att f&aring; tag p&aring; sina handledare eller inte fick respons i tid p&aring; inl&auml;mnat material. Kursledningen &auml;r dock flexibel och f&ouml;rs&ouml;kte l&ouml;sa problemen n&aring;gorlunda.<p>
Tentamen &auml;r det ocks&aring; p&aring; kursen. H&auml;r f&aring;r man ha med sig kurslitteraturen och ska sedan f&ouml;rs&ouml;ka applicera teorier p&aring; en situation. Problemet &auml;r att det saknas absoluta svar, utan att flera alternativ &auml;r m&ouml;jliga. M&aring;nga upplevde tentan som on&ouml;dig. De flesta som gick kursen tyckte dock att den var b&aring;de intressant och l&auml;rorik om man borts&aring;g fr&aring;n kr&aring;ngel under projektet.<p>
<A NAME="ENDFILE"><PRE> </PRE></A><A HREF="Komplement.Bok.html"><IMG SRC="fm2html-toc.gif" width=16 height=16 alt="">Innehĺll</A> <A HREF="Baksida.html"><IMG SRC="fm2html-next.gif" width=16 height=16 alt="">Nästa kapitel</A> 
</p>

<font size=4>

<br><hr><center><address><a href=mailto:webmaster-d@isy.liu.se>webmaster-d@isy.liu.se</a></address>


