<html>
<head><title>Vad h&auml;nder p&aring; D&ouml;mD -97</title></head>
<body bgcolor="#FFFFAA">

<img src="bilder/domdtop.gif"><br><br>
<img src="bilder/3dsign.gif" align=right>
<h1><i>Tre dagar i ytterfilen!</i></h1>
<h2>Torsdagen</h2>
Samtliga lag blir uppm&ouml;tta oberoende av hur de har tagit sig hit genom trafiken
och varje g&auml;stlag f&aring;r minst en fadder som kommer att gajda er r&auml;tt genom h&auml;lgen.
Det hela inleds med <b>f&ouml;rD&ouml;mD</b>. En &aring;v&auml;r&aring;lssittning i K&aring;rallen i regi av r&auml;kstaben f&ouml;r
allt folk utifr&aring;n plus en del annat l&ouml;st folk. Snart ansluter sig ocks&aring; hela linkeboda-maffian till ett gigantiskt &aring;ver&aring;lsr&ouml;j som fortg&aring;r hela natten.<br>
Naturligtvis r&ouml;jjer lajvband j&auml;rnet och vi ser till att ni aldrig f&aring;r en tr&aring;kig stund!
F&ouml;r allt folk h&auml;rifr&aring;n som vill ansluta sig till detta megaparty s&aring; sl&aring;r D-Group till
och erbjuder er biljetter f&ouml;r <b>endast TIO (10) sp&auml;nn!!</b> (i detta biljettpris ing&aring;r f&ouml;rutom intr&auml;de och lajvband dessutom en liten &ouml;verraskning) Biljettsl&auml;ppet &auml;r den 7/4 kl 22.00 
p&aring; Herrg&aring;rn, d&auml;r vi k&ouml;r pub och pilkv&auml;ll samtidigt. Missa <b>inte</b> denna kalasstart p&aring; v&aring;rens festligheter.<p>
<font size=4><i>Full fart f&ouml;r f&ouml;rv&auml;ntansfullt f&ouml;rd&ouml;mdt festsuget folk!</i></font>

<h2>Fredagen</h2>
G&auml;ster, vakna! Tidigt naturligtvis eftersom ni m&aring;sste hinna uppleva allt skoj som h&auml;nder
p&aring; dagen. Eran accelerationsf&ouml;rm&aring;ga s&auml;tts p&aring; rej&auml;lt prov.... Se till att h&auml;nga med redan fr&aring;n b&ouml;rjan.
Ni blir omh&auml;ndertagna av v&aring;ra mycket rutinerade gamlingar: Aristocats och X-Group<br> och det 
blir fart och fest fr&aring;n morgon till kv&auml;ll. <b>(Gl&ouml;m inte badkl&auml;der!)</b> Ni kommer naturligtvis
inte att f&aring; en lugn stund med dessa som lekledare.<br>
Senare p&aring; kv&auml;llen blir det &aring;ver&aring;lssittning p&aring; Herrg&aring;rn, dit Linkebodam&auml;nniskor senare kan 
ansluta. Sj&auml;lvklart spelar &aring;rhundratets lajvband: SAMH och visar att det inte bara
&auml;r SMHI som kan bjuda p&aring; h&ouml;gtryck. <p>

<font size=4><i>Visa att <b>du</b> inte bangar ett chickenrace!</i></font>

<h2>L&ouml;rdagen - Dagen D</h2>
Frukost till alla g&auml;ster redan p&aring; morronen. Sedan klockan 10.00 prick b&ouml;rjar t&auml;vlingen, 
en rafflande kamp i dart som slutar i att endast tv&aring; lag &aring;terst&aring;r i t&auml;vlingen. Under tiden
&auml;r gasquen &ouml;ppen d&auml;r man kan k&ouml;pa mat och dryck. Det blir n&aring;gra timmars paus s&aring; att alla
kan pusta ut och byta om. Klockan 18.30 g&aring;r finalen av stapeln. Vilket lag ska vinna det
&auml;rofulla priset av en resa till Darten och &ouml;lens hemland - England. Finalen avg&ouml;rs i b&auml;st
av tre ben och under tiden bjuds alla sittningsg&auml;ster p&aring; f&ouml;rsdrink. D&aring; vinnaren &auml;r utsedd
b&ouml;rjar finsittningen med trer&auml;tters middag, gyckel och underh&aring;llning. D&aring; banquetten b&ouml;rjar
n&auml;rma sig sitt slut s&aring; presenterar vi &aring;rets hemliga artist(er), och vi lovar att ni kommer
att bli heln&ouml;jda. D&auml;refter (22.30) dukas borden av och eftersl&auml;ppet &ouml;ppnas. Barerna fylls,
bandet spelar och musiken fl&ouml;dar. <br>
F&ouml;r Link&ouml;pingsbor: Sittningen kostar 280:- och eftersl&auml;pp 80:- (inkl. mat och dryck)<br>
Observera att detta &auml;r en finsittning, allts&aring; inga jeans, sportskor eller latexsuspensuarer!<p>

<font size=4><i>Cruising all night long.......</i></font>

</body>
</html>