<html>
<head><title>D&ouml;mD - T&auml;vlingsregler</title></head>
<body bgcolor="#FFFFAA">

<h1><i>Trafikreglerna</i></h1>
Spelf&aring;rm: 301 (trehundraett) f&ouml;r 2 (tv&aring;) lag best&aring;ende av 4 (fyra) personer vardera.
<ul>

<li> Under <b><font size=5>D</font>ÖM<font size=5>D</font><sup>TM</sup></b> g&auml;ller f&ouml;ljande
regler. Men det &auml;r <sup>ÖVER</sup>DOMAREN</sup> som &auml;r jokern i leken, allts&aring; &auml;r det hon som best&auml;mmer!

<br><br><li> Ett lag best&aring;r l&auml;mpligen av 4 personer. 2 lagmedlemmar och 2 lagutanlemmar. (dvs minst
tv&aring; av varje k&ouml;n) En av dessa &auml;r bara coach och ska se till att de andra kastar n&auml;r de ska kasta.

<br><br><li> Lagen ska rangordna sina kastare i ordningen: Herr G&aring;rman, Televinken och Anita.

<br><br><li> Lagen ska sj&auml;lva se till att de har pilar (s&aring;nna d&auml;r spetsiga saker som &aring;ker fort mot tavlan). Pilarna ska besiktas (och siktas) av trafikpolisen (matchdomaren) och godk&auml;nnas
innan varje match.

<br><br><li> T&auml;vlingen sker i cup-f&aring;rm. Det blir allts&aring; mindre &aring; mindre &aring; mindre folk kvar f&ouml;r
varje omg&aring;ng.

<br><br><li> Lagen ska sj&auml;lva h&aring;lla koll p&aring; vem som ska kasta n&auml;r och p&aring; vad. Varje match annonseras
i laodspikers. D&aring; har man fem minuter p&aring; sig att komma annars diskas man ju.

<br><br><li> En match spelas i b&auml;st av tre ben. F&ouml;rst m&ouml;ts Herr G&aring;rmanarna, sen Anitorna och sist men minst Televinkarna.

<br><br><li> Vilken av de tv&aring; kombatanterna som ska m&ouml;tas avg&ouml;rs genom mittning. B&aring;da spelarena kastar allts&aring; varsin pil och den som kom n&auml;rmast mitten f&aring;r b&ouml;rja. Tr&auml;ffar b&aring;da <i>Bull's ring</i> eller <i>Bull's Eye</i> s&aring; g&ouml;rs ny mittning. Trafikpolisen kan ocks&aring; beg&auml;ra ommittning vid tveksamma fall.

<br><br><li> Efter en kastomg&aring;ng subtraheras (minusas) den uppn&aring;dda po&auml;ngen fr&aring;n spelarens resterande po&auml;ngsumma. En kastomg&aring;ng best&aring;r av tre pilar.

<br><br><li> De b&aring;da spelarna turas om att avverka sina kastomg&aring;ngar och reducerar d&auml;rmed sina respektive po&auml;ngsummor.

<br><br><li> Ett ben avslutas och vinns av den spelare som kommit ner till ett jamnt tal mellan 50 och tv&aring; och d&auml;refter g&ouml;r utg&aring;ng genom att tr&auml;ffa en dubbel s&aring; att po&auml;ngsumman reduceras till noll. Som dubbel r&auml;knas den yttre smala delen av po&auml;ngf&auml;ltet samt <i>Bull's Eye</i>.
F&aring;r en spelare 1 eller mindre po&auml;ng kvar d&ouml;ms han som "tjock" (alternativt "fet" eller "fl&auml;skberg"). Spelaren st&aring;r d&aring; kvar p&aring; den tidigare po&auml;ngsumman.

<br><br><li> N&auml;r en spelare kommit ner till ett tal mellan 50 och 2 har denne 5 f&ouml;rs&ouml;k p&aring; sig att g&ouml;ra utg&aring;ng genom att tr&auml;ffa en dubbel. D&auml;refter till&auml;mpas enkel utg&aring;ng, varvid man endast
har kravet att komma ner till noll n&auml;r kastomg&aring;ngen &auml;r slut. Man blir nu bara "tjock" d&aring; man
f&aring;r mindre &auml;n noll po&auml;ng kvar.

<br><br><li> F&aring;r en spelare utg&aring;ng efter f&ouml;rsta eller andra pilen beh&ouml;ver de &aring;terst&aring;ende pilarna inte kastas.

<br><br><li> Vi summering av po&auml;ng r&auml;knas endast de pilar som <b>tydligt</b> sitter fast i tavlan efter avslutad kastomg&aring;ng. Pilar som studsar, lossnar, exploderar, missar tavlan eller fastnar i andra pilar r&auml;kns allts&aring; inte.

<br><br><li> Spelare skall befinna sig bakom heldragen linje vid kast. Om spelare st&aring;r framf&ouml;r eller p&aring; linjen d&ouml;ms hela kastomg&aring;ngen ut och spelaren st&aring;r kvar p&aring; sin tidigare po&auml;ng.

<br><br><li> Man f&aring;r inte kasta om pilar som kastats. Om man blir st&ouml;rd under kastningen ska man avbryta kastet innan man sl&auml;pper pilen eller s&aring; f&aring;r man skylla sig sj&auml;lv.

<br><br><li> Tappas en pil framf&ouml;r heldragen linje s&aring; r&auml;knas denna som "tappad" och d&auml;rmed (bort)kastad.

<br><br><li> Trafikpolisens beslut skall respekteras. Om det &auml;nd&aring; finns n&aring;n liten olydig trafikant som inte vill lyda, s&aring; kan beslutet &ouml;verklagas till h&ouml;gsta h&ouml;nset = <sup>ÖVER</sup>DOMAREN.

<br><br><li> Det &auml;r f&ouml;rbjudet att kasta pilarna p&aring; trafikpoliserna och &ouml;verdomaren.

<br><br><li> Stilpriset best&auml;ms av enh&auml;lligt av D-Group och bed&ouml;mningen &auml;r helt partisk.

<br><br><li> Tre priser delas ut. Link&ouml;pingssektionsb&auml;stalagpris. Stilpris. Samt naturligtvis den mycket &auml;rorika, beryktade, fantastiska D&ouml;mDm&auml;star-titlen 1997. Det sistn&auml;mde inneb&auml;r f&ouml;rutom &auml;ra, ber&ouml;mmelse och dyrkan en resa till London.

</ul>

<p>
Som sagt: Det &auml;r Överdomaren som best&auml;mmer. Överdomare under D&ouml;mD 1997 &auml;r - 
<a href=mailto:"q95krili@und.ida.liu.se">Kicki O'Dragly</a> 
</body>
</html>





</body>
</html>