<HTML>
<HEAD>
   <TITLE>trakiga sidan,ju!</TITLE>
 
</HEAD>
<BODY bgcolor="#FFFFAA">
<FONT SIZE=-2></FONT>
<H1><FONT SIZE=+3>TR&Aring;KIGA SIDAN</FONT><SUP><FONT SIZE=+1>TM</FONT></SUP></H1>

<P>H&auml;r nedan f&ouml;ljer lite saker som &auml;r v&auml;ldigt viktigt
att veta.</P>

<P><FONT SIZE=+1>1. Alkohol. </FONT></P>

<P>Numera har K&aring;rallen (v&aring;rt k&aring;rhus), p&aring; gott och
ont ett permanent tillst&aring;nd f&ouml;r att servera alkohol. Dessutom
har p&aring; grund av diverse slagsm&aring;l och vandalism polisen f&aring;tt
upp &ouml;gonen f&ouml;r oss. Detta inneb&auml;r att vi m&aring;ste vara
v&auml;ldigt strikta. Egen alkohol f&aring;r inte under n&aring;gra omst&auml;ndigheter
f&ouml;ras in i K&aring;rallen, all alkohol vi finner (p&aring; k&aring;rallen
d&aring; allts&aring;), kommer att beslagtagas och sl&auml;ngas. Men, ni
kommer att finna att v&aring;ra priser (tack vare det permanenta tillst&aring;ndet)
&auml;r mycket humana. Tillst&aring;ndet inneb&auml;r &auml;ven att vi
m&aring;ste st&auml;nga klockan tre, men medans vi st&auml;dar, f&aring;r
ni leka med X-Group &amp; Aristocats p&aring; Sk&aring;land, ni kan ju
f&ouml;rs&ouml;ka vara vakna tills de st&auml;nger...</P>

<P><FONT SIZE=+1>2. Kl&auml;der </FONT></P>

<P>Nu kommer &auml;nnu &auml;n punkt n&auml;r jag m&aring;ste gn&auml;lla,
p&aring; L&ouml;rdagssittningen (som &auml;r en finsittning som sagt var)
&auml;r det en strikt kl&auml;dsel som g&auml;ller, dvs finkl&auml;der
av ngt slag (kostym eller motsvarande dvs kl&auml;dsel kavaj, som etiketten
ben&auml;mner det), med jeans, gymnastikskor eller t-shirt, blir ni inte
insl&auml;ppta, utan f&aring;r tillbringa kv&auml;llen med att studera
stj&auml;rnor eller n&aring;got lika sp&auml;nnande. D&auml;remot, kan
vi varmt rekommendera att ni medf&ouml;r badkl&auml;der, f&ouml;r det kommer
att beh&ouml;vas.</P>

<P><FONT SIZE=+1>3. Pengar </FONT></P>

<P>Kom ih&aring;g att ni inte &auml;r anm&auml;lda f&ouml;rr&auml;n vi
har f&aring;tt in betalningen f&ouml;r samtliga lagmedlemmar (vi har begr&auml;nsat
med plats, och vi vill vara s&auml;kra p&aring; att s&aring; m&aring;nga
som bara &auml;r m&ouml;jligt f&aring;r roa sig under D&ouml;mD). Priset
f&ouml;r er &auml;r 600 kronor per person, postgirokontot allt skall betalas
till &auml;r: 44 07 39-1, gl&ouml;m inte att ange lagets namn, samt numret
p&aring; f&ouml;rra sidan.</P>

<P><FONT SIZE=+1>4. Mig sj&auml;lv </FONT></P>

<P>Den kanske tr&aring;kigaste punkten av dem alla... Fr&aring;gor, kr&aring;ngel
av alla de slag, transportproblem, konstiga ankomsttider, och det mesta
annat som ni kan hitta p&aring; att strula om, skall ni ta med mig. </P>

<P>Jag kan n&aring;s p&aring; olika s&auml;tt: </P>

<P><FONT SIZE=+1>tel: </FONT></P>

<P>013-17 5246 (hem, telesvar mest), </P>

<P>013-31 0778 (sektionsrum) </P>

<P><FONT SIZE=+1>mejl: </FONT></P>

<P><A HREF="mailto: ekstam@lysator.org">ekstam@lysator.org</A> (troligtvis
det b&auml;sta) </P>

<P><FONT SIZE=+1>vykort, alt bes&ouml;k: </FONT></P>

<P>Henrik O'Dragly </P>

<P>Rysdv. 254 B13 </P>

<P>584 34 Link&ouml;ping. </P>
<a href="domd.html">Tillbaka till de roligare inslagen, tack</a>

</BODY>
</HTML>
