<html>
<head><title>Om Varkorren</title></head>
<body bgcolor="#FFFFFF">

<h1>Varkorren</h1>
<i>Deckus Maximus</i>
<a href="varkorre_instruktion.html"><h4>Hur man tillverkar en varkorre</h4></a>
<p>

<img src="bilder/varkorre.gif" align=left>

Varkorren tillh&ouml;r ett sl&auml;kte som l&auml;nge varit utrotningshotat men som 
under det senaste &aring;ret f&aring;tt nytt f&auml;ste i det svenska kulturlandskapet.
Varkorren &auml;r en skygg ras och kan vara sv&aring;r att f&aring; syn p&aring; i &ouml;ppna och 
ljusa omr&aring;den, men om man v&auml;l funnit en varkorres revir l&auml;mnar den
s&auml;llan platsen.
<p>

<b>Utseende: </b>Varkorren k&auml;nns igen p&aring; sina mycket karakteristiska
ansiktsdrag. N&auml;bben &auml;r vanligtvis helt svart, ibland n&aring;got fl&auml;ckig,
och ut fr&aring;n denna kan man sk&ouml;nja tre m&ouml;rka linjer p&aring; varje sida som 
str&auml;cker sig mot bakre delen av huvudet. M&aring;nga varkorrar har ocks&aring; 
m&ouml;rka partier under sina oftast r&ouml;daktiga &ouml;gon.
<p>

<b>F&ouml;rekomst: </b>Varkorren &auml;r mest f&ouml;rekommande i de &ouml;sterg&ouml;tska 
landskapet, framf&ouml;r allt kring Valla-omr&aring;det, men har &auml;ven observerats i de 
V&auml;rml&auml;ndska skogarna. Den syns oftast ensam, 
men det &auml;r inte helt ovanligt att man ibland kan iaktta flera
varkorrar inom samma omr&aring;de. Detta torde dock mest tyda p&aring; slumpen &auml;n
p&aring; att varkorren skulle ha n&aring;got st&ouml;rre socialt liv.
<p>

<b>D&auml;ckningsplats: </b>Varkorren d&auml;ckar helst i avskilda omr&aring;den d&auml;r
den inte st&ouml;rs allt f&ouml;r mycket av omgivningen, g&auml;rna i n&aring;gon redan 
befintlig h&aring;la eller skrymsle. Det h&auml;nder ocks&aring; att varkorren &aring;terv&auml;nder
till tidigare d&auml;ckningsplatser. Kring Valla i &ouml;sterg&ouml;tland kan man ofta 
se varkorrar som d&auml;ckat i Bell-omr&aring;det.
<p>

<b>Beteende: </b>F&ouml;re d&auml;ckningsperioden drar sig varkorren tillbaka
och s&ouml;ker d&aring; snabbt upp en d&auml;ckningsplats. Valet av plats &auml;r av mindre 
betydelse och de flesta skrymslen brukar duga. N&auml;r varkorren v&auml;l funnit
en l&auml;mplig plats stannar den d&auml;r tills d&auml;ckningen &auml;r &ouml;ver och l&auml;mnar i
princip aldrig platsen. Ibland kan det tyckas n&auml;st intill om&ouml;jligt att 
k&ouml;ra iv&auml;g en varkorre fr&aring;n den f&ouml;rsta d&auml;ckningsplatsen, men om man lyckas
s&ouml;ker den mycket snabbt upp en ny plats och forts&auml;tter d&auml;ckandet d&auml;r.
<p>

<b>L&auml;te: </b>Varkorren ger s&auml;llan ifr&aring;n sig n&aring;gra utm&auml;rkande l&auml;ten, men
man kan ibland h&ouml;ra mumlande ljud som: Hrmf...Mmmhh...L&aring;tmejva...rghh...