<html>
<head><title>Kartf&ouml;rklaring</title></head>
<body bgcolor="#FFFFAA">


<h1>Karta &ouml;ver D&ouml;mD-omr&aring;det</h1>
Tryck p&aring; en plats för info



<br><br><br><hr><br><br><br>

<a name="skit">
<h3>Matn&auml;ra (=aff&auml;r)</h3>
Hur n&auml;ra? Skitn&auml;ra!<br>
Bra &ouml;ppettider ifall allt annat skulle vara st&auml;ngt

<br><br><br><hr><br><br><br>

<a name="ryde">
<h3>Ryd E</h3>
H&auml;r bor de flesta studenterna i kuliga k&aring;rrid&aring;rer.<br>
Troligtvis kommer m&aring;nga utomst&aring;ende att hamna h&auml;r
eftersom era faddrar bor h&auml;r d&aring;'ra.<br>
Obs! Stadsplaneraren har n&auml;mligen spexat till det n&aring;got
s&aring; husnumreringen kommer i slumpm&auml;ssig ordning, s&aring; det &auml;r bara
att chansa villt om man vill hitta ett speciellt hus. 

<br><br><br><hr><br><br><br>

<a name="rydf">
<h3>Ryd F</h3>
K&aring;rrid&aring;rsrumsihopklumpningscentral. <br>
Ryd F, Ryds Alle' eller Beverly ryd.

<br><br><br><hr><br><br><br>

<a name="danderyd">
<h3>Dande-Ryd</h3>
Finfina studentl&auml;genheter utan en massa jobbiga k&aring;rrid&aring;rer.<br>
Mer k&auml;nt som "BK-udda" (BK = Bj&ouml;rnk&auml;rrsgatan)

<br><br><br><hr><br><br><br>

<a name="rydshallen">
<h3>Rydshallen</h3>
Liten, liten, liten r&ouml;d idrottshall som egentligen inte alls &auml;r 
r&ouml;d utan &auml;r gul och brun.<br>
J&auml;tteb&auml;st som m&ouml;tesplats n&auml;r alla sprungit bort sig.

<br><br><br><hr><br><br><br>

<a name="vivo">
<h3>K&ouml;pcentrum</h3>
Mataff&auml;rer och lite s&aring;nt. Men det allra b&auml;sta:<br>
<b>En partyprylsaff&auml;r!</b><br>
Har allt som finns, ungef&auml;r som skalman med skalet.
Hela st&auml;llet har lite d&aring;liga &ouml;ppettider bara.

<br><br><br><hr><br><br><br>

<a name="statoil">
<h3>Statoil</h3>
Wow! H&auml;r st&aring;r Maria mitt i natten och s&auml;ljer korv.<br>
Grillad, kokt, i baguette, med vitl&ouml;k - you name it.<br>
Perfekt som efterfestmat. Öppet dygnet runt, &aring;ret runt!

<br><br><br><hr><br><br><br>

<a name="mbacken">
<h3>M&auml;rkesbacken</h3>
En backe med en massa m&auml;rken i den. Har man hittat den har
man hittat universitetet ju. Varning! M&aring;nga m&auml;nnskor som 
cyklar i en riktining klockan 8.05 och 12.05. Jobbigt att
g&aring; motstr&ouml;ms!

<br><br><br><hr><br><br><br>

<a name="herrgarn">
<h3>Herrg&aring;rn</h3>
En finfin Herrg&aring;rd d&auml;r g&auml;sterna f&aring;r en sittning p&aring; fredagen, d&aring; de kommer att underh&aring;llas
av A-Cats och X-Group. De ser ocks&aring; till att ni f&aring;r leka av er ordentligt.<br>
<a href="http://www.lysator.liu.se/xgroup/samh/" target="_top">
V&auml;rldens b&auml;sta Lajvband -SAMH- </a>r&ouml;jjer s&aring;klart!

<br><br><br><hr><br><br><br>

<a name="skaland">
<h3>Sk&aring;land</h3>
Detta &auml;r efterfestlokalen! N&auml;r festen lider mot sitt slut s&aring; kan man alltid 
varva ner h&auml;r. En liten r&ouml;d stuga mitt p&aring; "Farliga F&auml;ltet".

<br><br><br><hr><br><br><br>

<a name="partyplejset">
<h3>Partyplejset no 1 - K&aring;rallen</h3>
Sittning p&aring; Torsdagen f&ouml;r alla g&auml;ster + inbjudna linkebodabarn. F&ouml;ljs av ett rungande och gungande over&aring;lsr&ouml;j som lyfter taket p&aring; K&aring;rallen!
Lajvband naturligtvis.<br>
Sj&auml;lva t&auml;vlingen g&aring;r av stapeln h&auml;r ocks&aring;, L&ouml;rdag kl. 12.00 inleds t&auml;vlandet
bland &ouml;ver 500 t&auml;vlanden k&auml;mpar om &auml;ra och stilpris. Snart &aring;terst&aring;r bara tv&aring; lag
som senare p&aring; kv&auml;llen m&ouml;ts i en rafflande final p&aring;:<br>
Helgens h&ouml;jdpunkt: L&ouml;rdagsbanquetten. Finsittning med hemlig artist,
tre-r&auml;ttersmiddag, gyckel och underh&aring;llning. Band senare p&aring; kv&auml;llen d&aring; eftersl&auml;ppet
v&auml;ller in.


<br><br><br><br><br><br><br>
<br><br><br><br><br><br><br>
<br><br><br><br><br><br><br>
<br><br><br><br><br><br><br>
<br><br><br><br><br><br><br>
<br><br><br><br><br><br><br>

<font color="#FFFFFF">Hej d&aring;!</font>

</body>
</html>